Razer3001/ATARI_XF551_RP/ESP32_Slave_Bridge/ESP32_Slave_Bridge.ino
// ================================================================
// VERSION: F24_CODE_CLEAN_STEP1_2026-05-21_1325
// ARCHIVO: ESP32_Slave_Bridge.ino
// NOTA: version/build visible al abrir el .ino. Limpieza binaria paso 1: helpers no llamados eliminados.
// ================================================================

// ================================================================
// VERSION: F24_CODE_CLEAN_STEP1_2026-05-21_1325
// ARCHIVO: ESP32_Slave_Bridge.ino
// ROL: SLAVE
// NOTA: Versión definida dentro del .ino y visible por Serial.
// ================================================================

#include <Arduino.h>
#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <HardwareSerial.h>
#include <stdarg.h>
#include "DiskDensityTypes.h"
#include "EspNowQueueTypes.h"
#include "BridgeProtocol.h"

static const char SLAVE_BUILD[] = "F24_CODE_CLEAN_STEP1_2026-05-21_1325";

#ifndef TYPE_SUPERDOS_HINT
#define TYPE_SUPERDOS_HINT 0x42
#endif

#ifndef ESP_IDF_VERSION_MAJOR
#define ESP_IDF_VERSION_MAJOR 4
#endif

// ======== SIO hacia XF551 ========
#define SIO_RX      16
#define SIO_TX      17
#define SIO_COMMAND 18

HardwareSerial SerialSIO(2);

// Códigos SIO
#define SIO_ACK      0x41
#define SIO_NAK      0x4E
#define SIO_COMPLETE 0x43
#define SIO_ERROR    0x45

// ======== Protocolo ESP-NOW ========

enum DriveProfile : uint8_t;

// Tipos TYPE_* , CHUNK_PAYLOAD y PERCOM_* vienen desde BridgeProtocol.h
#define MAX_SECTOR_BYTES  256
#define SECTOR_128        128
#define SECTOR_256        256
#define MAX_PREFETCH_SECTORS 26

#define ESPNOW_CHANNEL 1

static inline uint32_t getLE32(const uint8_t* p) {
  return (uint32_t)p[0] |
         ((uint32_t)p[1] << 8) |
         ((uint32_t)p[2] << 16) |
         ((uint32_t)p[3] << 24);
}
static inline void putLE32(uint8_t* p, uint32_t v) {
  p[0]=(uint8_t)(v); p[1]=(uint8_t)(v>>8); p[2]=(uint8_t)(v>>16); p[3]=(uint8_t)(v>>24);
}

// ===== DEBUG/ROBUSTEZ (runtime desde WEB) =====
static uint8_t  g_verifyFlags = 0b1110;
static bool g_verifyAllWrites = false;
static bool g_verifyBootSectors = true;
static bool g_verifyVtocDir = true;
static bool g_verifyWriteWithVerify = true;

static void applyVerifyFlags(uint8_t f) {
  g_verifyFlags = f;
  g_verifyAllWrites       = (f & 0x01) != 0;
  g_verifyBootSectors     = (f & 0x02) != 0;
  g_verifyVtocDir         = (f & 0x04) != 0;
  g_verifyWriteWithVerify = (f & 0x08) != 0;
}

static uint32_t g_netDelayUs = 0;

static uint32_t g_xfSioBaud = 19200;
static uint32_t g_pendingXfSioBaud = 0;

// V5: deduplicar CFG_UPDATE. La web/Master puede enviar varios ajustes
// seguidos; durante loaders no queremos reprogramar ni loguear lo mismo.
static uint32_t g_lastCfgSio = 0;
static uint32_t g_lastCfgNet = 0;
static uint8_t  g_lastCfgVflg = 0xFF;

static void applyXfSioBaudNow(uint32_t baud) {
  if (baud < 9600) baud = 9600;
  if (baud > 115200) baud = 115200;
  if (baud == g_xfSioBaud) return;

  SerialSIO.end();
  delay(10);
  SerialSIO.begin((uint32_t)baud, SERIAL_8N1, SIO_RX, SIO_TX);
  g_xfSioBaud = baud;
}

// ===== actividad/idle =====
static volatile uint32_t g_lastActivityMs = 0;
static inline void markActivity() { g_lastActivityMs = millis(); }
static inline bool isIdleFor(uint32_t ms) { return (millis() - g_lastActivityMs) > ms; }

static const uint32_t INTERBYTE_GAP_MS = 200;   // Restaurado
static const uint32_t DRAIN_MS         = 1;     // Camino rápido: drenado mínimo
static const uint8_t  AUTO_READAHEAD_EXTRA = 0; // v16: sin read-ahead automático
static const uint8_t  NEXT_TRACK_PRELOAD_THRESHOLD = 0; // v16: next-track preload desactivado
static const uint8_t  NEXT_TRACK_PRELOAD_SECTORS   = 0; // v16: next-track preload desactivado
static const uint8_t  BOOT_CACHE_SECTORS          = 3; // Sectores 1-3: cache dedicada de arranque
static const uint8_t  TRACK_BURST_SECTORS         = 3; // micro-burst dentro de la misma pista
static const uint8_t  TRACK_BURST_MIN_STREAK      = 2; // V6: recién prefetch automático tras 2 lecturas secuenciales
static const uint8_t  AUTO_READAHEAD_SEQ_EXTRA = 0; // v16: sin secuencia automática
static const uint32_t SERIAL_DEBUG_BAUD = 460800;
static const bool LOG_READ_OK = false;
static const bool LOG_CACHE_HIT = false;
static const bool LOG_CACHE_DIAG = false; // v18: apagar diag por defecto para velocidad
static const bool LOG_PREFETCH = false;
static const bool LOG_RECOVER  = false;

// IDs
const uint8_t DEV_MIN = 0x31; // D1
const uint8_t DEV_MAX = 0x34; // D4

// El SLAVE ya no usa un ID lógico fijo. El MASTER decide D1..D4 por MAC.
// El SLAVE detecta automáticamente la unidad física real del drive (jumpers).
uint8_t g_physicalDev = DEV_MIN;
volatile uint8_t g_lastLogicDev = DEV_MIN;

enum DriveProfile : uint8_t {
  PROFILE_XF551 = 0,
  PROFILE_1050_STOCK = 1,
  PROFILE_1050_DD_MOD = 2,
};

static DriveProfile g_driveProfile = PROFILE_XF551;
static bool supports256 = true;
static bool g_supportsPercomRW = true;
static bool g_prefersStatusForDensity = false;
static bool g_is1050Like = false;
static bool g_supportsFormat22 = true;
static bool g_currentDD = false;

static const char* driveProfileName(DriveProfile p) {
  switch (p) {
    case PROFILE_1050_STOCK:  return "1050 stock";
    case PROFILE_1050_DD_MOD: return "1050 DD mod";
    case PROFILE_XF551:
    default:                  return "XF551";
  }
}

static void applyDriveProfile(DriveProfile p) {
  g_driveProfile = p;
  switch (p) {
    case PROFILE_1050_STOCK:
      supports256 = false;
      g_supportsPercomRW = false;
      g_prefersStatusForDensity = true;
      g_is1050Like = true;
      g_supportsFormat22 = true;
      break;
    case PROFILE_1050_DD_MOD:
      supports256 = true;
      g_supportsPercomRW = false;
      g_prefersStatusForDensity = true;
      g_is1050Like = true;
      g_supportsFormat22 = true;
      break;
    case PROFILE_XF551:
    default:
      supports256 = true;
      g_supportsPercomRW = true;
      g_prefersStatusForDensity = false;
      g_is1050Like = false;
      g_supportsFormat22 = true;
      break;
  }
}

// AUTO-DETECCIÓN DE DENSIDAD
static bool g_diskDensityKnown = false;
static DiskDensity g_diskDensity = DENS_UNKNOWN;
static uint16_t g_diskBytesPerSector = 128;
static uint16_t g_diskSectorsPerTrack = 18;
static bool g_ddForceActive = false;
static uint32_t g_lastDdForceMs = 0;
static DiskDensity g_last128Density = DENS_SD;


