Razer3001/ATARI_XF551_RP/ESP32_Slave_Bridge/ESP32_Slave_Bridge.ino
// STATUS lógico temporal para no arrastrar errores crudos de la XF551
// cuando FORMAT/WRITE ya terminaron correctamente.
static bool g_statusOverrideActive = false;
static uint8_t g_statusOverride[4] = {0x00, 0xFF, 0xFE, 0x00};
static uint32_t g_statusOverrideUntilMs = 0;

// Compatibilidad específica para secuencias tipo SuperDOS (PERCOM->FORMAT->WRITE inicial).
static uint32_t g_superdosCompatUntilMs = 0;
static uint8_t  g_superdosCompatDev = 0;
static uint32_t g_lastReadPercomPendingMs = 0;
static uint8_t  g_lastReadPercomPendingDev = 0;
static uint32_t g_lastWritePercomAfterPendingMs = 0;
static uint8_t  g_lastWritePercomAfterPendingDev = 0;

static inline void enableSuperdosCompat(uint8_t devLogic, uint32_t durationMs, const char* reason) {
  g_superdosCompatDev = devLogic;
  g_superdosCompatUntilMs = millis() + durationMs;
  if (reason && *reason) {
    logf("[COMPAT] SuperDOS compat ON dev=0x%02X por %lums (%s)",
         devLogic, (unsigned long)durationMs, reason);
  }
}

static inline bool superdosCompatIsActive(uint8_t devLogic) {
  if (g_superdosCompatUntilMs == 0) return false;
  if (g_superdosCompatDev != 0 && devLogic != 0 && g_superdosCompatDev != devLogic) return false;
  if ((int32_t)(g_superdosCompatUntilMs - millis()) <= 0) {
    g_superdosCompatUntilMs = 0;
    g_superdosCompatDev = 0;
    return false;
  }
  return true;
}

static inline bool hadRecentPercomPendingSequence(uint8_t devLogic) {
  if (g_lastReadPercomPendingDev != devLogic) return false;
  if (g_lastWritePercomAfterPendingDev != devLogic) return false;
  uint32_t now = millis();
  if ((now - g_lastReadPercomPendingMs) > 15000UL) return false;
  if ((now - g_lastWritePercomAfterPendingMs) > 15000UL) return false;
  if (g_lastWritePercomAfterPendingMs < g_lastReadPercomPendingMs) return false;
  return true;
}

static inline const char* densityName(DiskDensity d) {
  switch (d) {
    case DENS_SD: return "SD";
    case DENS_ED: return "ED";
    case DENS_DD: return "DD";
    default:      return "UNKNOWN";
  }
}

static inline bool densityUses256(DiskDensity d) {
  return (d == DENS_DD);
}

static inline void remember128Density(DiskDensity d) {
  if (d == DENS_SD || d == DENS_ED) g_last128Density = d;
}

static inline DiskDensity hostVisibleDensity() {
  if (g_ddForceActive) return DENS_DD;
  if (g_diskDensityKnown) {
    if (g_diskDensity == DENS_DD) return g_last128Density;
    return g_diskDensity;
  }
  return g_last128Density;
}

static inline uint16_t expectedSectorSizeForMode(DiskDensity d, uint16_t sec) {
  if (densityUses256(d) && !(sec >= 1 && sec <= 3)) return SECTOR_256;
  return SECTOR_128;
}

static inline uint16_t expectedSectorSizeForDensity(bool dd, uint16_t sec) {
  return expectedSectorSizeForMode(dd ? DENS_DD : DENS_SD, sec);
}

static inline uint16_t sectorsPerTrackForDensity(DiskDensity d) {
  if (d == DENS_ED) return 26;
  if (d == DENS_SD || d == DENS_DD) return 18;
  return g_diskSectorsPerTrack ? g_diskSectorsPerTrack : 18;
}


static inline void clearStatusOverride() {
  g_statusOverrideActive = false;
  g_statusOverrideUntilMs = 0;
}

static inline bool statusOverrideIsActive() {
  if (!g_statusOverrideActive) return false;
  if ((int32_t)(g_statusOverrideUntilMs - millis()) <= 0) {
    clearStatusOverride();
    return false;
  }
  return true;
}

static inline void buildCleanStatusForDensity(DiskDensity d, uint8_t st[4]) {
  st[0] = 0x00;
  if (d == DENS_ED) st[0] |= 0x80;
  st[1] = 0xFF;
  st[2] = (d == DENS_ED) ? 0xE0 : 0xFE;
  st[3] = 0x00;
}

static inline void armStatusOverrideForDensity(DiskDensity d, uint32_t durationMs, const char* reason) {
  if (d != DENS_DD) return;
  if (!superdosCompatIsActive(g_lastLogicDev)) return;
  buildCleanStatusForDensity(d, g_statusOverride);
  g_statusOverrideActive = true;
  g_statusOverrideUntilMs = millis() + durationMs;
  if (reason && *reason) {
    logf("[SLAVE] STATUS lógico limpio armado (%s) dens=%s bytes=%02X %02X %02X %02X por %lums",
         reason,
         densityName(d),
         g_statusOverride[0], g_statusOverride[1], g_statusOverride[2], g_statusOverride[3],
         (unsigned long)durationMs);
  }
}

// [F24] Eliminado helper no usado: sectorsRemainingInTrack
static inline uint16_t trackStartForSector(uint16_t sec, DiskDensity d) {
  if (sec <= 3) return sec;
  uint16_t spt = sectorsPerTrackForDensity(d);
  if (spt == 0) spt = 18;
  return (uint16_t)(4 + (((sec - 4) / spt) * spt));
}

static inline uint8_t sectorIndexInTrack(uint16_t sec, DiskDensity d) {
  if (sec <= 3) return 0;
  uint16_t spt = sectorsPerTrackForDensity(d);
  if (spt == 0) spt = 18;
  return (uint8_t)((sec - 4) % spt);
}



const uint8_t BCAST_MAC[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

// Forward declarations for Arduino auto-prototype safety
static bool xfReadStatusRaw(uint8_t out[4], uint8_t aux1, uint8_t aux2);
static bool xfStatusIndicatesDD(const uint8_t st[4]);
static const char* xfStatusDensityName(const uint8_t st[4]);
static bool xfForceDDByPercom(uint8_t devLogical);
static inline const char* percomModeName(const uint8_t* p);
bool readPercomFromXF(uint8_t devLogical, uint8_t aux1, uint8_t aux2, uint8_t* outBuf);
bool writePercomToXF(uint8_t devLogical, uint8_t aux1, uint8_t aux2, const uint8_t* buf, int len);
static void runXf551DensityDiagnostics(uint8_t devLogical);
static void xfDiagProbeSector(uint8_t devLogical, uint16_t sec, DiskDensity mode);
static void buildSyntheticPercomForProfile(uint8_t outBuf[PERCOM_BLOCK_LEN], DiskDensity d);
static void logDriveProfileSummary(const char* reason);


uint8_t g_lastMaster[6] = {0};
bool    g_haveMasterMac = false;

// TRACK CACHE
static uint8_t  cacheBuf[MAX_PREFETCH_SECTORS][MAX_SECTOR_BYTES];
static uint32_t cacheValidMask = 0;   // 1 bit por sector dentro de la pista actual
static uint16_t cacheTrackStartSec = 0;
static uint8_t  cacheTrackSpt      = 0;
static uint8_t  cacheCount         = 0;   // cantidad de sectores válidos en la pista actual
static uint8_t  cacheDev           = 0;
static DiskDensity cacheDensity    = DENS_UNKNOWN;

// NEXT TRACK CACHE (precarga conservadora de la pista siguiente)
static uint8_t  cacheNextBuf[MAX_PREFETCH_SECTORS][MAX_SECTOR_BYTES];
static uint32_t cacheNextValidMask = 0;
static uint16_t cacheNextTrackStartSec = 0;
static uint8_t  cacheNextTrackSpt      = 0;
static uint8_t  cacheNextCount         = 0;
static uint8_t  cacheNextDev           = 0;
static DiskDensity cacheNextDensity    = DENS_UNKNOWN;

