Razer3001/ATARI_XF551_RP/ESP32_Slave_Bridge/ESP32_Slave_Bridge.ino
// BOOT CACHE (sectores 1-3)
static uint8_t  bootCacheBuf[BOOT_CACHE_SECTORS][MAX_SECTOR_BYTES];
static uint8_t  bootCacheValidMask = 0;
static uint8_t  bootCacheDev       = 0;

// SEQUENTIAL READ TRACKING
static uint16_t    lastReadSec     = 0;
static uint8_t     lastReadDev     = 0;
static DiskDensity lastReadDensity = DENS_UNKNOWN;
static uint8_t     seqReadStreak   = 0;

static inline void invalidateNextTrackCache() {
  cacheNextValidMask = 0;
  cacheNextTrackStartSec = 0;
  cacheNextTrackSpt = 0;
  cacheNextCount = 0;
  cacheNextDev = 0;
  cacheNextDensity = DENS_UNKNOWN;
}

static inline void resetTrackCache() {
  cacheValidMask = 0;
  cacheTrackStartSec = 0;
  cacheTrackSpt = 0;
  cacheCount = 0;
  cacheDev = 0;
  cacheDensity = DENS_UNKNOWN;
  invalidateNextTrackCache();
}

static inline void swapTrackCaches() {
  uint8_t tmpSec[MAX_SECTOR_BYTES];
  for (uint8_t i = 0; i < MAX_PREFETCH_SECTORS; ++i) {
    memcpy(tmpSec, cacheBuf[i], MAX_SECTOR_BYTES);
    memcpy(cacheBuf[i], cacheNextBuf[i], MAX_SECTOR_BYTES);
    memcpy(cacheNextBuf[i], tmpSec, MAX_SECTOR_BYTES);
  }

  uint32_t tmpMask = cacheValidMask;
  cacheValidMask = cacheNextValidMask;
  cacheNextValidMask = tmpMask;

  uint16_t tmpStart = cacheTrackStartSec;
  cacheTrackStartSec = cacheNextTrackStartSec;
  cacheNextTrackStartSec = tmpStart;

  uint8_t tmpSpt = cacheTrackSpt;
  cacheTrackSpt = cacheNextTrackSpt;
  cacheNextTrackSpt = tmpSpt;

  uint8_t tmpCount = cacheCount;
  cacheCount = cacheNextCount;
  cacheNextCount = tmpCount;

  uint8_t tmpDev = cacheDev;
  cacheDev = cacheNextDev;
  cacheNextDev = tmpDev;

  DiskDensity tmpDensity = cacheDensity;
  cacheDensity = cacheNextDensity;
  cacheNextDensity = tmpDensity;
}

static inline void invalidateBootCache() {
  bootCacheValidMask = 0;
  bootCacheDev = 0;
}

static inline bool bootCacheHit(uint8_t devLogic, uint16_t sec) {
  if (sec < 1 || sec > BOOT_CACHE_SECTORS) return false;
  if (bootCacheDev != devLogic) return false;
  uint8_t idx = (uint8_t)(sec - 1);
  return (bootCacheValidMask & (1U << idx)) != 0;
}

static inline void bootCacheStore(uint8_t devLogic, uint16_t sec, const uint8_t* buf, int len) {
  if (!buf || len <= 0) return;
  if (sec < 1 || sec > BOOT_CACHE_SECTORS) return;
  if (bootCacheDev != devLogic) {
    invalidateBootCache();
    bootCacheDev = devLogic;
  }
  uint8_t idx = (uint8_t)(sec - 1);
  memcpy(bootCacheBuf[idx], buf, (size_t)len);
  bootCacheValidMask |= (1U << idx);
}

static inline void preloadBootCache(uint8_t devLogic, DiskDensity mode, uint16_t sectorSize) {
  if (bootCacheDev != devLogic) {
    invalidateBootCache();
    bootCacheDev = devLogic;
  }
  for (uint16_t s = 1; s <= BOOT_CACHE_SECTORS; ++s) {
    uint8_t idx = (uint8_t)(s - 1);
    if (bootCacheValidMask & (1U << idx)) continue;
    int r = readSectorFromXFMode(devLogic, s, mode, bootCacheBuf[idx]);
    if (r == (int)sectorSize) {
      bootCacheValidMask |= (1U << idx);
    }
  }
}

// WRITE buffers
static uint8_t  writeBuf[MAX_SECTOR_BYTES];
static int      writeExpected  = 0;
static int      writeMaxEnd    = 0;
static uint8_t  writeChunkCount = 0;
static uint32_t writeChunkMask  = 0;

static bool     writePending   = false;
static uint8_t  writePendDev   = 0;
static uint8_t  writePendCmd   = 0;
static bool     writePendDD    = false;
static uint16_t writePendSec   = 0;

// PERCOM WRITE buffer
static uint8_t  percomWriteBuf[PERCOM_BLOCK_LEN];
static int      percomLen      = 0;
static bool     percomWritePending = false;
static uint8_t  percomWriteDev     = 0;

static uint8_t g_percomAux1 = 0;
static uint8_t g_percomAux2 = 0;

// Último PERCOM escrito por el master y aún relevante para FORMAT/READ PERCOM
static bool     g_percomPendingValid = false;
static uint8_t  g_percomPendingBlock[PERCOM_BLOCK_LEN];

// [F24] Eliminado helper no usado: enableSuperdosCompatFromProbe
static uint8_t  g_percomPendingCmd   = 0;
static bool     g_percomPendingNeedsReadback = false;
static uint32_t g_lastPercomWriteMs = 0;

// HELLO control
static uint32_t g_lastNetActivityMs = 0;
static uint32_t g_lastHelloMs       = 0;

// FIX: Flag para suprimir HELLO durante FORMAT
static volatile bool g_formatInProgress = false;

// ======== DEBUG COUNTERS ========
static uint32_t g_totalReads = 0;
static uint32_t g_totalWrites = 0;
static uint32_t g_checksumFailures = 0;
static uint32_t g_verifyFailures = 0;

// ======== Cola RX ESP-NOW (procesar fuera del callback Wi-Fi) ========
#define RX_QUEUE_LEN 8
#define RX_PKT_MAX   256

static PendingEspNowPacket g_rxQueue[RX_QUEUE_LEN];
static volatile uint8_t g_rxQHead = 0;
static volatile uint8_t g_rxQTail = 0;
static volatile uint32_t g_rxDrops = 0;
static portMUX_TYPE g_rxQMutex = portMUX_INITIALIZER_UNLOCKED;

static bool enqueueRxPacket(const uint8_t* src, const uint8_t* data, int len) {
  if (!data || len <= 0) return false;
  if (len > RX_PKT_MAX) len = RX_PKT_MAX;

  bool ok = false;
  portENTER_CRITICAL(&g_rxQMutex);
  uint8_t next = (uint8_t)((g_rxQHead + 1) % RX_QUEUE_LEN);
  if (next != g_rxQTail) {
    PendingEspNowPacket &pkt = g_rxQueue[g_rxQHead];
    pkt.valid = true;
    pkt.hasSrc = (src != nullptr);
    if (src) memcpy(pkt.src, src, 6);
    pkt.len = len;
    memcpy(pkt.data, data, len);
    g_rxQHead = next;
    ok = true;
  } else {
    g_rxDrops++;
  }
  portEXIT_CRITICAL(&g_rxQMutex);
  return ok;
}

static bool dequeueRxPacket(PendingEspNowPacket &out) {
  bool ok = false;
  portENTER_CRITICAL(&g_rxQMutex);
  if (g_rxQTail != g_rxQHead) {
    out = g_rxQueue[g_rxQTail];
    g_rxQueue[g_rxQTail].valid = false;
    g_rxQTail = (uint8_t)((g_rxQTail + 1) % RX_QUEUE_LEN);
    ok = true;
  }
  portEXIT_CRITICAL(&g_rxQMutex);
  return ok;
}

// ======== Utilidades ========

void logf(const char* fmt, ...) {
  char b[256];
  va_list ap;
  va_start(ap, fmt);
  vsnprintf(b, sizeof(b), fmt, ap);
  va_end(ap);
  Serial.println(b);
}

uint8_t sioChecksum(const uint8_t* d, int len) {
  uint16_t s = 0;
  for (int i = 0; i < len; i++){
    s += d[i];
    if (s > 0xFF) s = (s & 0xFF) + 1;
  }
  return (uint8_t)(s & 0xFF);
}

static bool isBroadcastMac(const uint8_t* mac) {
  if (!mac) return false;
  for (int i = 0; i < 6; i++) if (mac[i] != 0xFF) return false;
  return true;
}

void ensurePeer(const uint8_t* mac) {
  if (!mac) return;
  if (esp_now_is_peer_exist(mac)) return;

