Razer3001/ATARI_XF551_RP/ESP32_Slave_Bridge/ESP32_Slave_Bridge.ino
  esp_now_peer_info_t p = {};
  memcpy(p.peer_addr, mac, 6);
  p.channel = ESPNOW_CHANNEL;
  p.encrypt = false;
  p.ifidx = WIFI_IF_STA;

  esp_err_t e = esp_now_add_peer(&p);
  if (e != ESP_OK && e != ESP_ERR_ESPNOW_EXIST) {
    logf("[ESPNOW] esp_now_add_peer fallo err=%d", (int)e);
  }
}

const uint8_t* replyMac() {
  return g_haveMasterMac ? g_lastMaster : BCAST_MAC;
}

static inline void throttleNet() {
  if (g_netDelayUs > 0) {
    uint32_t d = g_netDelayUs;
    if (d > 20000) d = 20000;
    delayMicroseconds(d);
  }
}

bool send_now_to(const uint8_t* mac, const uint8_t* data, int len) {
  if (!mac || !data || len <= 0) return false;
  ensurePeer(mac);

  esp_err_t e = esp_now_send(mac, data, len);
  if (e != ESP_OK) {
    logf("[ESPNOW] esp_now_send FAIL err=%d len=%d type=0x%02X", (int)e, len, data[0]);
    return false;
  }
  markActivity();
  throttleNet();
  return true;
}

void sendHello() {
  if (g_formatInProgress) return;  // FIX: No enviar durante FORMAT
  uint8_t p[4];
  p[0] = TYPE_HELLO;
  p[1] = g_physicalDev;
  p[2] = supports256  ? 1 : 0;
  p[3] = g_physicalDev;
  (void)send_now_to(BCAST_MAC, p, sizeof(p));
}

void sendACK() {
  uint8_t p[2] = {TYPE_ACK, g_lastLogicDev};
  (void)send_now_to(replyMac(), p, sizeof(p));
}
void sendNAK() {
  uint8_t p[2] = {TYPE_NAK, g_lastLogicDev};
  (void)send_now_to(replyMac(), p, sizeof(p));
}

// ======== SIO hacia XF551 ========

static void drainSio(uint32_t ms) {
  unsigned long t0 = millis();
  while (millis() - t0 < ms) {
    while (SerialSIO.available()) (void)SerialSIO.read();
    delay(1);
  }
}

static void drainSioAdaptive(uint32_t maxMs = 6, uint32_t idleUs = 1500) {
  uint32_t t0 = millis();
  uint32_t last = micros();

  while ((millis() - t0) < maxMs) {
    bool readAny = false;
    while (SerialSIO.available()) {
      (void)SerialSIO.read();
      readAny = true;
      last = micros();
    }
    if (!readAny && (micros() - last) > idleUs) break;
    yield();
  }
}

static uint16_t xfRecoveryDelayMs(uint16_t sec, int attempt, bool hadAck, int got, int expected) {
  (void)sec;
  (void)expected;

  // Tras un fallo con datos parciales/válidos conviene esperar cerca de una vuelta completa
  // del disco antes de reintentar. En XF551 suele rendir mejor que reintentar "demasiado pronto".
  if (!hadAck) {
    return (uint16_t)(120 + ((attempt > 1) ? 40 * (attempt - 1) : 0));
  }

  if (got > 0) {
    return (uint16_t)(220 + ((attempt > 1) ? 40 * (attempt - 1) : 0));
  }

  return (uint16_t)(160 + ((attempt > 1) ? 40 * (attempt - 1) : 0));
}

static void xfRecoveryAfterFailure(uint16_t sec, DiskDensity mode, int attempt, bool hadAck, int got, int expected) {
  uint16_t recoverMs = xfRecoveryDelayMs(sec, attempt, hadAck, got, expected);

  if (LOG_RECOVER) logf("[XF] Recover sec=%u (%s) try=%d ack=%s got=%d/%d wait=%ums",
       sec, densityName(mode), attempt, hadAck ? "Y" : "N", got, expected, recoverMs);

  drainSioAdaptive(12, 2000);
  delay(recoverMs);
}

void pulseCommandAndSendFrame(const uint8_t* frame5) {
  drainSioAdaptive(DRAIN_MS);

  digitalWrite(SIO_COMMAND, LOW);
  delayMicroseconds(1500);

  SerialSIO.write(frame5, 5);
  SerialSIO.flush();

  delayMicroseconds(2500);
  digitalWrite(SIO_COMMAND, HIGH);
}

static constexpr uint8_t XF_TERM_COMPLETE = SIO_COMPLETE;
static constexpr uint8_t XF_TERM_ERROR    = SIO_ERROR;
static constexpr uint8_t XF_TERM_NAK      = SIO_NAK;
static constexpr uint8_t XF_TERM_TIMEOUT  = 0xFF;

bool waitByte(uint8_t want, unsigned long timeoutMs) {
  unsigned long t0 = millis();
  while (millis() - t0 < timeoutMs) {
    if (SerialSIO.available()) {
      uint8_t b = SerialSIO.read();
      if (b == want) return true;

      if (b == SIO_NAK) {
        logf("[XF] Recibido NAK (0x4E) mientras esperaba 0x%02X", want);
        if (want != SIO_NAK) return false;
      }

      if (b == SIO_ERROR) {
        logf("[XF] Recibido ERROR (0x45) mientras esperaba 0x%02X", want);
        if (want != SIO_ERROR) return false;
      }
    }
    delay(1);
  }
  logf("[XF] Timeout esperando 0x%02X", want);
  return false;
}

bool xfReadByteTimeout(uint8_t &b, uint32_t timeoutMs) {
  unsigned long t0 = millis();
  while (millis() - t0 < timeoutMs) {
    if (SerialSIO.available()) {
      b = SerialSIO.read();
      return true;
    }
    delay(1);
  }
  return false;
}

static uint8_t xfWaitTerminator(uint32_t timeoutMs) {
  unsigned long start = millis();

  while ((millis() - start) < timeoutMs) {
    if (!SerialSIO.available()) {
      delayMicroseconds(80);
      continue;
    }

    uint8_t b = (uint8_t)SerialSIO.read();

    if (b == SIO_ACK)      continue;
    if (b == SIO_COMPLETE) return XF_TERM_COMPLETE;
    if (b == SIO_ERROR)    return XF_TERM_ERROR;
    if (b == SIO_NAK)      return XF_TERM_NAK;
  }

  return XF_TERM_TIMEOUT;
}

bool xfWaitComplete(uint32_t timeoutMs) {
  uint8_t t = xfWaitTerminator(timeoutMs);

  if (t == XF_TERM_COMPLETE) return true;

  if (t == XF_TERM_ERROR || t == XF_TERM_NAK) {
    logf("[XF] ERROR/NAK 0x%02X mientras esperábamos COMPLETE", (uint8_t)t);
    return false;
  }

  logf("[XF] Timeout esperando COMPLETE (0x43)");
  return false;
}

static bool xfReadExact(uint8_t* out, int n, uint32_t timeoutMs, int &got) {
  got = 0;
  unsigned long start = millis();

  while (got < n && (millis() - start) < timeoutMs) {
    while (SerialSIO.available() && got < n) {
      out[got++] = (uint8_t)SerialSIO.read();
    }
    if (got < n) delayMicroseconds(80);
  }

  return got == n;
}

static bool xfInterpretEmbeddedChecksum(uint8_t* buf, int got, int requested, int &payloadLen) {
  payloadLen = 0;
  if (got < 2) return false;
  if (got >= requested) return false;

  uint8_t chk = buf[got - 1];
  uint8_t calc = sioChecksum(buf, got - 1);
  if (chk != calc) return false;

  payloadLen = got - 1;
  return true;
}

static int xfReadUntilGap(uint8_t* out, int maxLen,
                          uint32_t firstByteTimeoutMs = 30,
                          uint32_t interByteGapMs = 3) {
  int got = 0;
  uint8_t b;

