Razer3001/ATARI_XF551_RP/ESP32_Slave_Bridge/ESP32_Slave_Bridge.ino
  if (!xfReadByteTimeout(b, firstByteTimeoutMs)) return 0;
  out[got++] = b;

  unsigned long last = millis();

  while (got < maxLen) {
    if (SerialSIO.available()) {
      out[got++] = (uint8_t)SerialSIO.read();
      last = millis();
    } else if ((millis() - last) >= interByteGapMs) {
      break;
    } else {
      delayMicroseconds(80);
    }
  }

  return got;
}

bool readFromDrive(uint8_t* out, int &dataLen, unsigned long timeoutMs,
                   bool allowErrorData = false,
                   bool allowShortRead = false) {
  int requested = dataLen;
  dataLen = 0;

  if (requested <= 0 || requested > MAX_SECTOR_BYTES) {
    logf("[XF] readFromDrive: requested invalido %d", requested);
    return false;
  }

  uint8_t term = xfWaitTerminator(timeoutMs);

  if (term == XF_TERM_TIMEOUT) {
    logf("[XF] readFromDrive: timeout esperando C/E");
    return false;
  }

  if (term == XF_TERM_NAK) {
    logf("[XF] readFromDrive: NAK");
    return false;
  }

  if (term == XF_TERM_COMPLETE) {
    int got = 0;

    if (!xfReadExact(out, requested, timeoutMs, got)) {
      int shortLen = 0;
      if (xfInterpretEmbeddedChecksum(out, got, requested, shortLen)) {
        dataLen = shortLen;
        logf("[XF] readFromDrive: COMPLETE con frame corto válido de %d bytes (se pidió %d)", shortLen, requested);
        return allowShortRead;
      }

      dataLen = got;
      logf("[XF] readFromDrive: incompleto got=%d esperado=%d", got, requested);
      return false;
    }

    uint8_t chk;
    if (!xfReadByteTimeout(chk, 1000)) {
      dataLen = got;
      logf("[XF] readFromDrive: sin checksum (%d)", requested);
      return false;
    }

    uint8_t calc = sioChecksum(out, requested);
    if (chk != calc) {
      dataLen = got;
      logf("[XF] CHECKSUM FAIL %d chk=%02X calc=%02X", requested, chk, calc);
      g_checksumFailures++;
      return false;
    }

    dataLen = requested;
    return true;
  }

  int got = xfReadUntilGap(out, requested, 30, 3);
  dataLen = got;

  if (got <= 0) {
    logf("[XF] readFromDrive: ERROR sin datos");
    return false;
  }

  int shortLen = 0;
  if (xfInterpretEmbeddedChecksum(out, got, requested, shortLen)) {
    dataLen = shortLen;
    logf("[XF] readFromDrive: ERROR con frame corto válido de %d bytes (se pidió %d)", shortLen, requested);
    return allowErrorData && allowShortRead;
  }

  uint8_t chk;
  if (!xfReadByteTimeout(chk, 80)) {
    logf("[XF] readFromDrive: ERROR con %d bytes pero sin checksum", got);
    return false;
  }

  uint8_t calc = sioChecksum(out, got);
  if (chk != calc) {
    logf("[XF] CHECKSUM FAIL(ERROR) got=%d chk=%02X calc=%02X", got, chk, calc);
    g_checksumFailures++;
    return false;
  }

  if (got == requested) {
    logf("[XF] readFromDrive: ERROR con %d bytes válidos", got);
    return allowErrorData;
  }

  logf("[XF] readFromDrive: ERROR con %d/%d bytes válidos", got, requested);
  return allowErrorData && allowShortRead;
}

static bool decodePercomBlock(const uint8_t percom[PERCOM_BLOCK_LEN], DiskGeometry& g) {
  g.tracks = percom[0];
  g.sectorsPerTrack = ((uint16_t)percom[2] << 8) | (uint16_t)percom[3];
  uint8_t sideCode = percom[4];
  g.sides = (sideCode & 0x01) ? 2 : 1;
  g.bytesPerSector = ((uint16_t)percom[6] << 8) | (uint16_t)percom[7];

  if (g.bytesPerSector == 0) g.bytesPerSector = SECTOR_128;
  if (g.sectorsPerTrack == 0) g.sectorsPerTrack = 18;

  g.density = DENS_UNKNOWN;
  if (g.bytesPerSector == 256) {
    g.density = DENS_DD;
  } else if (g.bytesPerSector == 128) {
    if (g.sectorsPerTrack == 26) g.density = DENS_ED;
    else g.density = DENS_SD;
  }

  g.valid = (g.tracks != 0 && g.sectorsPerTrack != 0 &&
             (g.bytesPerSector == 128 || g.bytesPerSector == 256));
  return g.valid;
}

// READ SECTOR con logging mejorado y soporte SD/ED/DD
int readSectorFromXFMode(uint8_t devLogical, uint16_t sec, DiskDensity mode, uint8_t* outBuf) {
  (void)devLogical;

  uint8_t frame[5];
  frame[0] = g_physicalDev;
  frame[1] = 0x52;
  frame[2] = (uint8_t)(sec & 0xFF);
  frame[3] = (uint8_t)(sec >> 8);
  frame[4] = sioChecksum(frame, 4);

  const int MAX_TRIES = 3;
  int sz = (int)expectedSectorSizeForMode(mode, sec);

  for (int attempt = 1; attempt <= MAX_TRIES; attempt++) {
    yield();
    pulseCommandAndSendFrame(frame);

    if (!waitByte(SIO_ACK, 5000)) {
      logf("[SLAVE D%u] READ sin ACK sec=%u (%s) (try %d/%d)",
           (unsigned)(g_lastLogicDev - 0x30), sec, densityName(mode), attempt, MAX_TRIES);
      xfRecoveryAfterFailure(sec, mode, attempt, false, 0, sz);
      continue;
    }

    int readLen = sz;
    bool ok = readFromDrive(outBuf, readLen, 15000);

    if (ok && readLen == sz) {
      if (mode == DENS_DD && sz == 256) {
        g_ddForceActive = true;
        g_lastDdForceMs = millis();
        g_diskDensity = DENS_DD;
        g_diskDensityKnown = true;
        g_diskBytesPerSector = 256;
      } else {
        remember128Density(mode);
      }
      g_totalReads++;
      if (LOG_READ_OK) {
        logf("[SLAVE D%u] ✅ READ OK sec=%u (%s) len=%d (try %d/%d) primeros: %02X %02X %02X %02X",
             (unsigned)(g_lastLogicDev - 0x30), sec, densityName(mode), readLen, attempt, MAX_TRIES,
             outBuf[0], outBuf[1], outBuf[2], outBuf[3]);
      }
      return readLen;
    }

    if (mode == DENS_DD && sec > 3 && sz == 256 && readLen == 128) {
      g_ddForceActive = false;
      g_diskDensityKnown = true;
      g_diskDensity = g_last128Density;
      g_diskBytesPerSector = 128;
      g_diskSectorsPerTrack = (g_last128Density == DENS_ED) ? 26 : 18;
      clearStatusOverride();
      logf("[XF] DD solicitado sec=%u pero llegaron 128 bytes: DD no confirmado por datos, volviendo a %s", sec, densityName(g_last128Density));
      if (attempt < MAX_TRIES) {
        primeXf551DD(devLogical);
      }
    }

    logf("[SLAVE D%u] READ fallo sec=%u (%s) (try %d/%d)",
         (unsigned)(g_lastLogicDev - 0x30), sec, densityName(mode), attempt, MAX_TRIES);
    xfRecoveryAfterFailure(sec, mode, attempt, true, readLen, sz);
  }

