Razer3001/ATARI_XF551_RP/ESP32_Slave_Bridge/ESP32_Slave_Bridge.ino
  return 0;
}

static void primeXf551DD(uint8_t devLogical) {
  (void)devLogical;
  if (!supports256) return;

  bool ddSelected = xfForceDDByPercom(devLogical);
  if (ddSelected) {
    logf("[SLAVE] DD seleccionado por STATUS/PERCOM; falta confirmarlo con READ=256");
  }

  uint8_t frame[5];
  frame[0] = g_physicalDev;
  frame[1] = 0x52;
  frame[2] = 0x04;
  frame[3] = 0x00;
  frame[4] = sioChecksum(frame, 4);

  logf("[SLAVE] Prime DD con lectura dummy sector 4...");

  for (int attempt = 1; attempt <= 2; attempt++) {
    drainSioAdaptive(DRAIN_MS, 1500);
    pulseCommandAndSendFrame(frame);

    if (!waitByte(SIO_ACK, 3000)) {
      logf("[SLAVE] Prime DD sin ACK (try %d/2)", attempt);
      continue;
    }

    uint8_t dummy[MAX_SECTOR_BYTES];
    int len = SECTOR_256;
    bool ok = readFromDrive(dummy, len, 4000, true, true);

    if (len == 256) {
      g_ddForceActive = true;
      g_lastDdForceMs = millis();
      g_diskDensity = DENS_DD;
      g_diskDensityKnown = true;
      g_diskBytesPerSector = 256;
      logf("[SLAVE] Prime DD OK: llegaron 256 bytes (%s)", ok ? "válidos" : "con ERROR");
      drainSioAdaptive(4, 1200);
      return;
    }

    if (len == 128) {
      g_ddForceActive = false;
      g_diskDensityKnown = true;
      g_diskDensity = g_last128Density;
      g_diskBytesPerSector = 128;
      g_diskSectorsPerTrack = (g_last128Density == DENS_ED) ? 26 : 18;
      clearStatusOverride();
      uint8_t st[4];
      if (xfReadStatusRaw(st, 0x00, 0x00)) {
        logf("[SLAVE] Prime DD: READ real sigue en 128 bytes (%s) status=%02X %02X %02X %02X",
             xfStatusDensityName(st), st[0], st[1], st[2], st[3]);
      } else {
        logf("[SLAVE] Prime DD: la XF551 sigue en 128 bytes (ED/SD) (try %d/2)", attempt);
      }
    } else {
      logf("[SLAVE] Prime DD: respuesta no útil len=%d (try %d/2)", len, attempt);
    }

    if (attempt < 2) {
      xfForceDDByPercom(devLogical);
    }

    drainSioAdaptive(4, 900);
    delay(4);
  }
}

// [F24] Eliminado helper no usado: readSectorFromXF
// ✅✅✅ WRITE con verificación runtime (base 1050c + timings RP_02) ✅✅✅
bool writeSectorToXF(uint8_t devLogical, uint8_t cmd, uint16_t sec, bool dd,
                     const uint8_t* buf, int len) {
  (void)devLogical;

  int expected = (int)expectedSectorSizeForMode(dd ? DENS_DD : hostVisibleDensity(), sec);
  if (!dd && expected > 128) expected = 128;

  uint8_t frame[5];
  frame[0] = g_physicalDev;
  uint8_t physCmd = (cmd == 0x57) ? 0x50 : cmd;
  frame[1] = physCmd;
  frame[2] = (uint8_t)(sec & 0xFF);
  frame[3] = (uint8_t)(sec >> 8);
  frame[4] = sioChecksum(frame, 4);

  uint8_t tmp[MAX_SECTOR_BYTES];
  memset(tmp, 0, sizeof(tmp));
  int copyLen = len;
  if (copyLen > expected) copyLen = expected;
  if (copyLen > 0) memcpy(tmp, buf, copyLen);
  uint8_t chk = sioChecksum(tmp, expected);

  const int MAX_TRIES = 3;
  for (int attempt = 1; attempt <= MAX_TRIES; attempt++) {
    drainSio(DRAIN_MS);
    pulseCommandAndSendFrame(frame);

    if (!waitByte(SIO_ACK, 5000)) {
      logf("[SLAVE D%u] WRITE sin ACK sec=%u (try %d/%d)",
           (unsigned)(g_lastLogicDev - 0x30), sec, attempt, MAX_TRIES);
      delay(120);
      continue;
    }

    SerialSIO.write(tmp, expected);
    SerialSIO.flush();
    SerialSIO.write(chk);
    SerialSIO.flush();

    if (!xfWaitComplete(25000)) {
      logf("[SLAVE D%u] WRITE sin COMPLETE sec=%u (try %d/%d)",
           (unsigned)(g_lastLogicDev - 0x30), sec, attempt, MAX_TRIES);
      delay(150);
      continue;
    }

    bool doVerify = false;
    if (g_verifyAllWrites) {
      doVerify = true;
    } else {
      if (g_verifyWriteWithVerify && cmd == 0x57) doVerify = true;
      if (g_verifyBootSectors && (sec >= 1 && sec <= 3)) doVerify = true;
      if (g_verifyVtocDir && (sec >= 360 && sec <= 368)) doVerify = true;
    }

    DiskDensity logMode = dd ? (g_ddForceActive ? DENS_DD : hostVisibleDensity()) : hostVisibleDensity();

    if (doVerify) {
      delay(20);

      uint8_t rb[MAX_SECTOR_BYTES];
      DiskDensity verifyMode = dd ? DENS_DD : logMode;
      int r = readSectorFromXFMode(devLogical, sec, verifyMode, rb);

      if (r != expected) {
        logf("[SLAVE D%u] ❌ VERIFY FAIL sec=%u: read=%d esperado=%d (try %d/%d)",
             (unsigned)(g_lastLogicDev - 0x30), sec, r, expected, attempt, MAX_TRIES);
        g_verifyFailures++;

        if (attempt < MAX_TRIES) {
          delay(200);
          continue;
        }
        return false;
      }

      if (memcmp(rb, tmp, expected) != 0) {
        logf("[SLAVE D%u] ❌ VERIFY FAIL sec=%u: datos no coinciden (try %d/%d)",
             (unsigned)(g_lastLogicDev - 0x30), sec, attempt, MAX_TRIES);
        g_verifyFailures++;

        for (int i = 0; i < expected; i++) {
          if (rb[i] != tmp[i]) {
            logf("  Diff @ offset %d: escribí 0x%02X, leí 0x%02X", i, tmp[i], rb[i]);
            if (i >= 10) {
              logf("  (más diferencias omitidas)");
              break;
            }
          }
        }

        if (attempt < MAX_TRIES) {
          delay(200);
          continue;
        }
        return false;
      }

      logf("[SLAVE D%u] ✅ VERIFY OK sec=%u (%s)",
           (unsigned)(g_lastLogicDev - 0x30), sec, densityName(logMode));
    }

    g_totalWrites++;
    logf("[SLAVE D%u] ✅ WRITE OK sec=%u (%s) primeros: %02X %02X %02X %02X",
         (unsigned)(g_lastLogicDev - 0x30), sec, densityName(logMode),
         tmp[0], tmp[1], tmp[2], tmp[3]);

    armStatusOverrideForDensity(logMode, 4000, "WRITE OK");
    return true;
  }

  logf("[SLAVE D%u] ❌ WRITE FALLÓ sec=%u después de %d intentos",
       (unsigned)(g_lastLogicDev - 0x30), sec, MAX_TRIES);
  return false;
}

// PERCOM READ/WRITE / síntesis por perfil
static void buildSyntheticPercomForProfile(uint8_t outBuf[PERCOM_BLOCK_LEN], DiskDensity d) {
  memset(outBuf, 0, PERCOM_BLOCK_LEN);
  outBuf[0] = 40;
  outBuf[1] = 0x04;

  uint16_t spt = 18;
  uint16_t bps = 128;
  uint8_t sidesMinusOne = 0x00;
  uint8_t densityCode = 0x00;

