Razer3001/ATARI_XF551_RP/ESP32_Slave_Bridge/ESP32_Slave_Bridge.ino
  if (d == DENS_ED) {
    spt = 26;
    bps = 128;
  } else if (d == DENS_DD) {
    if (supports256) {
      spt = 18;
      bps = 256;
      densityCode = 0x04;
      if (g_driveProfile == PROFILE_XF551) sidesMinusOne = 0x00;
    } else {
      spt = 26;
      bps = 128;
    }
  }

  outBuf[2] = (uint8_t)(spt >> 8);
  outBuf[3] = (uint8_t)(spt & 0xFF);
  outBuf[4] = sidesMinusOne;
  outBuf[5] = densityCode;
  outBuf[6] = (uint8_t)(bps >> 8);
  outBuf[7] = (uint8_t)(bps & 0xFF);
}

static void logDriveProfileSummary(const char* reason) {
  logf("[PROFILE] %s => %s | PERCOM=%s | 256B=%s | STATUS density=%s | FORMAT22=%s",
       reason ? reason : "perfil",
       driveProfileName(g_driveProfile),
       g_supportsPercomRW ? "sí" : "no",
       supports256 ? "sí" : "no",
       g_prefersStatusForDensity ? "sí" : "no",
       g_supportsFormat22 ? "sí" : "no");
}

bool readPercomFromXF(uint8_t devLogical, uint8_t aux1, uint8_t aux2, uint8_t* outBuf) {
  (void)devLogical;
  if (!g_supportsPercomRW) {
    DiskDensity d = hostVisibleDensity();
    if (d == DENS_UNKNOWN) d = g_prefersStatusForDensity ? DENS_SD : g_last128Density;
    buildSyntheticPercomForProfile(outBuf, d);
    logf("[%s] READ PERCOM sintético: mode=%s bps=%u spt=%u sides=%u",
         driveProfileName(g_driveProfile),
         percomModeName(outBuf),
         (unsigned)percomBytesPerSector(outBuf),
         (unsigned)percomSectorsPerTrack(outBuf),
         (unsigned)percomSides(outBuf));
    return true;
  }

  uint8_t frame[5] = { g_physicalDev, 0x4E, aux1, aux2, 0x00 };
  frame[4] = sioChecksum(frame, 4);

  pulseCommandAndSendFrame(frame);

  if (!waitByte(SIO_ACK, 4000)) {
    logf("[SLAVE D%u] READ PERCOM sin ACK", (unsigned)(g_lastLogicDev - 0x30));
    return false;
  }

  int len = PERCOM_BLOCK_LEN;
  if (!readFromDrive(outBuf, len, 10000)) {
    logf("[SLAVE D%u] READ PERCOM fallo lectura", (unsigned)(g_lastLogicDev - 0x30));
    return false;
  }
  return true;
}

static inline const char* percomModeName(const uint8_t* p) {
  uint16_t spt = percomSectorsPerTrack(p);
  uint16_t bps = percomBytesPerSector(p);
  uint8_t sides = percomSides(p);

  if (spt == 26 && bps == 128) return "ED";
  if (bps == 256 && sides >= 2) return "DSDD";
  if (bps == 256) return "SSDD";
  return "SD";
}


static bool sanitizePercomForDos25(uint8_t* p) {
  uint16_t bps = percomBytesPerSector(p);
  uint16_t spt = percomSectorsPerTrack(p);
  uint8_t sides = percomSides(p);

  // Para unidades tipo XF551/compatibles con 256 bytes por sector,
  // preservar el PERCOM 128/18/2 (MyDOS 4.55 lo usa para formatos DD/DS)
  // y NO degradarlo a ED. La sanitización a 26x128 aplica solo a rutas 1050.
  if (supports256 && bps == 128 && spt == 18 && sides == 2) {
    logf("[XF] WRITE PERCOM 128/18/2 preservado para MyDOS/XF551 (sin saneo a ED)");
    return false;
  }

  // Flujo observado de DOS 2.5/1050: PERCOM 128/18/2 que termina
  // arrastrando un FORMAT SD. Lo saneamos a 1050 ED (40x26x128, una cara).
  if (!supports256 && bps == 128 && spt == 18 && sides == 2) {
    p[0] = 40;                  // tracks
    p[1] = 0x04;                // step rate / reservado
    p[2] = 0x00; p[3] = 0x1A;   // 26 sectors por pista
    p[4] = 0x00;                // 1 cara
    p[5] = 0x00;                // density code compatible 128-byte
    p[6] = 0x00; p[7] = 0x80;   // 128 bytes/sector
    logf("[1050] WRITE PERCOM saneado a ED: bps=128 spt=26 sides=1");
    return true;
  }

  return false;
}

static inline bool percomUses256(const uint8_t* p) {
  return percomBytesPerSector(p) >= 256;
}

static void buildPercomSSDD(uint8_t out[PERCOM_BLOCK_LEN]) {
  out[0]  = 40;
  out[1]  = 0x00;
  out[2]  = 0x00; out[3]  = 18;
  out[4]  = 0x00;
  out[5]  = 0x04;
  out[6]  = 0x01; out[7]  = 0x00;
  out[8]  = 0x01;
  out[9]  = 0x41;
  out[10] = 0x00;
  out[11] = 0x00;
}

static bool xfReadStatusRaw(uint8_t out[4], uint8_t aux1, uint8_t aux2) {
  uint8_t frame[5] = { g_physicalDev, 0x53, aux1, aux2, 0x00 };
  frame[4] = sioChecksum(frame, 4);

  drainSio(DRAIN_MS);
  pulseCommandAndSendFrame(frame);

  if (!waitByte(SIO_ACK, 3000)) return false;

  int len = 4;
  if (!readFromDrive(out, len, 8000, true, true)) return false;
  return len >= 4;
}

static bool xfStatusIndicatesDD(const uint8_t st[4]) {
  return ((st[0] & 0x20) != 0) && ((st[0] & 0x80) == 0);
}

static const char* xfStatusDensityName(const uint8_t st[4]) {
  if (st[0] & 0x80) return "ED";
  if (st[0] & 0x20) return "DD";
  return "SD";
}

static bool xfForceDDByPercom(uint8_t devLogical) {
  if (!supports256) return false;

  uint8_t percom[PERCOM_BLOCK_LEN];
  buildPercomSSDD(percom);

  logf("[XF] WRITE PERCOM -> forzando SSDD (18 spt, 256 bps, 1 side)");
  if (!writePercomToXF(devLogical, 0x00, 0x00, percom, PERCOM_BLOCK_LEN)) {
    logf("[XF] WRITE PERCOM DD fallo");
    return false;
  }

  delay(8);

  uint8_t rb[PERCOM_BLOCK_LEN];
  bool percomOk = readPercomFromXF(devLogical, 0x00, 0x00, rb);
  if (percomOk) {
    logf("[XF] READ PERCOM tras WRITE: mode=%s bps=%u spt=%u sides=%u",
         percomModeName(rb), (unsigned)percomBytesPerSector(rb),
         (unsigned)percomSectorsPerTrack(rb), (unsigned)percomSides(rb));
  } else {
    logf("[XF] READ PERCOM tras WRITE falló");
  }

  uint8_t st[4];
  bool statusOk = xfReadStatusRaw(st, 0x00, 0x00);
  if (statusOk) {
    logf("[XF] STATUS tras WRITE PERCOM: %02X %02X %02X %02X => %s",
         st[0], st[1], st[2], st[3], xfStatusDensityName(st));
  } else {
    logf("[XF] STATUS tras WRITE PERCOM falló");
  }

  // OJO: PERCOM/STATUS solo indican el modo seleccionado/reportado.
  // DD queda confirmado únicamente cuando un READ sec>3 devuelve 256 bytes reales.
  return statusOk && xfStatusIndicatesDD(st);
}

// AUTO-DETECCIÓN: Consulta PERCOM del XF551 para saber densidad del disco
bool autoDetectDiskDensity() {
  logf("[SLAVE] Auto-detectando densidad del disco...");

  if (g_prefersStatusForDensity) {
    uint8_t st[4];
    if (!xfReadStatusRaw(st, 0x00, 0x00)) {
      logf("[%s] ❌ No se pudo leer STATUS para detectar densidad", driveProfileName(g_driveProfile));
      return false;
    }
    DiskDensity d = (st[0] & 0x80) ? DENS_ED : ((supports256 && (st[0] & 0x20)) ? DENS_DD : DENS_SD);
    g_diskDensity = d;
    g_diskDensityKnown = true;
    g_diskBytesPerSector = densityUses256(d) ? 256 : 128;
    g_diskSectorsPerTrack = (d == DENS_ED) ? 26 : 18;
    remember128Density(d);
    logf("[%s] ✅ Disco detectado por STATUS: %s (%u bytes/sector, spt=%u)",
         driveProfileName(g_driveProfile), densityName(d),
         (unsigned)g_diskBytesPerSector, (unsigned)g_diskSectorsPerTrack);
    return true;
  }

  uint8_t percom[PERCOM_BLOCK_LEN];
  if (!readPercomFromXF(g_lastLogicDev, 0x00, 0x00, percom)) {
    logf("[SLAVE] ❌ No se pudo leer PERCOM del disco");
    return false;
  }

  DiskGeometry geom = {};
  if (!decodePercomBlock(percom, geom)) {
    logf("[SLAVE] ❌ PERCOM inválido");
    return false;
  }

