Razer3001/ATARI_XF551_RP/ESP32_Slave_Bridge/ESP32_Slave_Bridge.ino
  g_diskBytesPerSector  = geom.bytesPerSector;
  g_diskSectorsPerTrack = geom.sectorsPerTrack;
  g_diskDensity         = geom.density;
  g_diskDensityKnown    = (geom.density != DENS_UNKNOWN);
  remember128Density(geom.density);
  g_ddForceActive       = false;

  if (geom.density == DENS_DD) {
    logf("[SLAVE] ✅ Disco reportado por PERCOM: %s (%u bytes/sector, spt=%u, sides=%u) -- DD aún no confirmado por READ",
         percomModeName(percom), (unsigned)geom.bytesPerSector,
         (unsigned)geom.sectorsPerTrack, (unsigned)geom.sides);
  } else {
    logf("[SLAVE] ✅ Disco detectado: %s (%u bytes/sector, spt=%u, sides=%u)",
         percomModeName(percom), (unsigned)geom.bytesPerSector,
         (unsigned)geom.sectorsPerTrack, (unsigned)geom.sides);
  }

  return g_diskDensityKnown;
}

// [F24] Eliminado helper no usado: getDiskDD
static void xfDiagProbeSector(uint8_t devLogical, uint16_t sec, DiskDensity mode) {
  (void)devLogical;

  uint8_t stBefore[4] = {0}, stAfter[4] = {0};
  bool haveBefore = xfReadStatusRaw(stBefore, 0x00, 0x00);

  uint8_t frame[5];
  frame[0] = g_physicalDev;
  frame[1] = 0x52;
  frame[2] = (uint8_t)(sec & 0xFF);
  frame[3] = (uint8_t)(sec >> 8);
  frame[4] = sioChecksum(frame, 4);

  uint8_t buf[MAX_SECTOR_BYTES];
  int req = (int)expectedSectorSizeForMode(mode, sec);
  int got = req;
  bool ack = false;
  bool ok = false;

  drainSio(DRAIN_MS);
  pulseCommandAndSendFrame(frame);
  ack = waitByte(SIO_ACK, 4000);
  if (ack) {
    ok = readFromDrive(buf, got, 12000, true, true);
  } else {
    got = 0;
  }

  bool haveAfter = xfReadStatusRaw(stAfter, 0x00, 0x00);

  logf("[DIAG] sec=%u mode=%s req=%d ack=%s ok=%s got=%d | status-before=%s %02X %02X %02X %02X | status-after=%s %02X %02X %02X %02X",
       sec, densityName(mode), req,
       ack ? "SI" : "NO",
       ok ? "SI" : "NO",
       got,
       haveBefore ? xfStatusDensityName(stBefore) : "N/A",
       stBefore[0], stBefore[1], stBefore[2], stBefore[3],
       haveAfter ? xfStatusDensityName(stAfter) : "N/A",
       stAfter[0], stAfter[1], stAfter[2], stAfter[3]);

  if (got > 0) {
    logf("[DIAG] sec=%u mode=%s primeros: %02X %02X %02X %02X",
         sec, densityName(mode), buf[0], buf[1], buf[2], buf[3]);
  }
}

static void runXf551DensityDiagnostics(uint8_t devLogical) {
  if (!supports256) {
    logf("[DIAG] Saltado: esta unidad/compilación no usa sectores de 256 bytes");
    return;
  }

  if (!isIdleFor(500) || writePending || percomWritePending || g_formatInProgress) {
    logf("[DIAG] Busy: espera a que el bridge esté idle para correr diagnóstico");
    return;
  }

  logf("[DIAG] ===== XF551 density diagnostic begin =====");
  logf("[DIAG] Unidad física=0x%02X lógica=0x%02X", g_physicalDev, devLogical);

  resetDiskDetection();
  autoDetectDiskDensity();

  const uint16_t sectors[] = {4, 18, 19, 361, 721};
  const int n = (int)(sizeof(sectors) / sizeof(sectors[0]));

  logf("[DIAG] --- Pasada ED (lecturas de 128) ---");
  for (int i = 0; i < n; i++) {
    xfDiagProbeSector(devLogical, sectors[i], DENS_ED);
    delay(20);
  }

  logf("[DIAG] --- Selección DD por PERCOM ---");
  bool sel = xfForceDDByPercom(devLogical);
  logf("[DIAG] WRITE/STATUS DD seleccionado=%s (sin confirmación aún)", sel ? "SI" : "NO");
  delay(20);

  logf("[DIAG] --- Pasada DD (lecturas de 256 donde corresponda) ---");
  for (int i = 0; i < n; i++) {
    xfDiagProbeSector(devLogical, sectors[i], DENS_DD);
    delay(20);
  }

  logf("[DIAG] ===== XF551 density diagnostic end =====");
}

// Resetear detección (para cuando se cambia el disco)
void resetDiskDetection() {
  g_diskDensityKnown = false;
  g_diskDensity = DENS_UNKNOWN;
  g_diskBytesPerSector = 128;
  g_diskSectorsPerTrack = 18;
  g_ddForceActive = false;
  g_lastDdForceMs = 0;
  g_last128Density = DENS_SD;
  clearStatusOverride();
  logf("[SLAVE] Detección de densidad reseteada");
}

bool writePercomToXF(uint8_t devLogical, uint8_t aux1, uint8_t aux2, const uint8_t* buf, int len) {
  (void)devLogical;
  // Perfiles 1050: aceptar PERCOM a nivel lógico, pero no enviarlo al hardware real.
  if (!g_supportsPercomRW) {
    logf("[%s] WRITE PERCOM lógico aceptado (no se envía al hardware)", driveProfileName(g_driveProfile));
    return true;
  }
  // Mantener compatibilidad XF551: enviar WRITE PERCOM con AUX=0/0 a la unidad física.
  (void)aux1;
  (void)aux2;

  uint8_t tmp[PERCOM_BLOCK_LEN];
  memset(tmp, 0, sizeof(tmp));
  if (len > PERCOM_BLOCK_LEN) len = PERCOM_BLOCK_LEN;
  memcpy(tmp, buf, len);

  uint8_t frame[5] = { g_physicalDev, 0x4F, 0x00, 0x00, 0x00 };
  frame[4] = sioChecksum(frame, 4);

  pulseCommandAndSendFrame(frame);

  if (!waitByte(SIO_ACK, 4000)) return false;

  SerialSIO.write(tmp, PERCOM_BLOCK_LEN);
  SerialSIO.flush();

  uint8_t chk = sioChecksum(tmp, PERCOM_BLOCK_LEN);
  SerialSIO.write(chk);
  SerialSIO.flush();

  if (!xfWaitComplete(20000)) return false;
  return true;
}

// ======== ENVÍO DE SECTOR AL MASTER ========

void sendSectorChunk(uint16_t sec, const uint8_t* buf, int len) {
  uint8_t pkt[6 + CHUNK_PAYLOAD];
  int cc = (len + CHUNK_PAYLOAD - 1) / CHUNK_PAYLOAD;
  if (cc <= 0) cc = 1;
  const uint8_t* mac = replyMac();

  for (int i = 0; i < cc; i++) {
    int off = i * CHUNK_PAYLOAD;
    int n   = min((int)CHUNK_PAYLOAD, len - off);

    pkt[0] = TYPE_SECTOR_CHUNK;
    pkt[1] = g_lastLogicDev;
    pkt[2] = (uint8_t)(sec & 0xFF);
    pkt[3] = (uint8_t)(sec >> 8);
    pkt[4] = (uint8_t)i;
    pkt[5] = (uint8_t)cc;
    memcpy(pkt + 6, buf + off, n);

    (void)send_now_to(mac, pkt, 6 + n);
    throttleNet();
    yield();
  }
}

// ======== HANDLERS LÓGICOS ========

void handleReadFromMaster(uint8_t devLogic, uint16_t sec, bool dd, uint8_t pfCount) {
  g_lastLogicDev = devLogic;
  writePending = false;
  percomWritePending = false;

  DiskDensity startMode = dd ? DENS_DD : DENS_SD;
  // READ_LOADER_V4: si el RP2040 fuerza DD, no dejar que una densidad sticky previa
  // SD/ED anule el rescate. Esto ayuda cuando la XF551 quedó visible en 128B.
  if (dd && sec > 3) {
    startMode = DENS_DD;
    g_ddForceActive = true;
    g_lastDdForceMs = millis();
  } else if (g_diskDensityKnown && g_diskDensity != DENS_UNKNOWN) {
    startMode = g_diskDensity;
  }

  // v18: densidad sticky por unidad/sesión.
  // Solo autodetectar si realmente aún no conocemos la densidad.
  if (!dd && sec > 3 && !g_diskDensityKnown) {
    autoDetectDiskDensity();
    if (g_diskDensityKnown && g_diskDensity != DENS_UNKNOWN) {
      startMode = g_diskDensity;
    }
  }

  uint8_t buf[MAX_SECTOR_BYTES];
  int sz = (int)expectedSectorSizeForMode(startMode, sec);
  bool servedFromCache = false;

  if (bootCacheHit(devLogic, sec)) {
    memcpy(buf, bootCacheBuf[sec - 1], sz);
    servedFromCache = true;
    if (LOG_CACHE_HIT) logf("[CACHE] ✅ Boot hit sec=%u", sec);
    if (LOG_CACHE_DIAG) logf("[CACHE-DIAG] BOOT HIT dev=D%u sec=%u size=%d", (unsigned)(devLogic - 0x30), (unsigned)sec, sz);
  }

