Razer3001/ATARI_XF551_RP/ESP32_Slave_Bridge/ESP32_Slave_Bridge.ino
  uint16_t reqTrackStart = trackStartForSector(sec, startMode);
  uint8_t  reqTrackSpt   = (sec <= 3) ? 1 : (uint8_t)sectorsPerTrackForDensity(startMode);
  uint8_t  reqTrackIdx   = sectorIndexInTrack(sec, startMode);

  if (!servedFromCache && cacheCount > 0 &&
      cacheDev == devLogic &&
      cacheDensity == startMode &&
      cacheTrackStartSec == reqTrackStart &&
      cacheTrackSpt == reqTrackSpt &&
      (cacheValidMask & (1UL << reqTrackIdx))) {
    memcpy(buf, cacheBuf[reqTrackIdx], sz);
    servedFromCache = true;
    if (LOG_CACHE_HIT) logf("[CACHE] ✅ Track hit sec=%u (%s)", sec, densityName(startMode));
    if (LOG_CACHE_DIAG) logf("[CACHE-DIAG] TRACK HIT dev=D%u sec=%u start=%u idx=%u valid=%u/%u dens=%s", (unsigned)(devLogic - 0x30), (unsigned)sec, (unsigned)reqTrackStart, (unsigned)reqTrackIdx, (unsigned)cacheCount, (unsigned)cacheTrackSpt, densityName(startMode));
  } else if (!servedFromCache && cacheNextCount > 0 &&
             cacheNextDev == devLogic &&
             cacheNextDensity == startMode &&
             cacheNextTrackStartSec == reqTrackStart &&
             cacheNextTrackSpt == reqTrackSpt &&
             (cacheNextValidMask & (1UL << reqTrackIdx))) {
    memcpy(buf, cacheNextBuf[reqTrackIdx], sz);
    servedFromCache = true;
    swapTrackCaches(); // promover la pista siguiente a pista actual al primer hit real
    if (LOG_CACHE_HIT) logf("[CACHE] ✅ Next-track hit sec=%u (%s)", sec, densityName(startMode));
    if (LOG_CACHE_DIAG) logf("[CACHE-DIAG] NEXT HIT dev=D%u sec=%u start=%u idx=%u nextValid=%u/%u dens=%s", (unsigned)(devLogic - 0x30), (unsigned)sec, (unsigned)reqTrackStart, (unsigned)reqTrackIdx, (unsigned)cacheCount, (unsigned)cacheTrackSpt, densityName(startMode));
  }

  if (!servedFromCache) {
    if (LOG_CACHE_DIAG) {
      logf("[CACHE-DIAG] MISS dev=D%u sec=%u start=%u idx=%u dens=%s boot=%u track=%u/%u next=%u/%u",
           (unsigned)(devLogic - 0x30),
           (unsigned)sec,
           (unsigned)reqTrackStart,
           (unsigned)reqTrackIdx,
           densityName(startMode),
           (unsigned)bootCacheHit(devLogic, sec),
           (unsigned)cacheCount,
           (unsigned)cacheTrackSpt,
           (unsigned)cacheNextCount,
           (unsigned)cacheNextTrackSpt);
    }
    DiskDensity candidates[3] = { DENS_UNKNOWN, DENS_UNKNOWN, DENS_UNKNOWN };

    if (g_ddForceActive && sec > 3) {
      candidates[0] = DENS_DD;
    }
    else if (sec > 3 && g_diskDensityKnown && g_diskDensity != DENS_UNKNOWN) {
      candidates[0] = g_diskDensity;
    }
    else {
      candidates[0] = startMode;
      if (startMode == DENS_SD) {
        candidates[1] = DENS_ED;
        candidates[2] = DENS_DD;
      } else if (startMode == DENS_ED) {
        candidates[1] = DENS_SD;
        candidates[2] = DENS_DD;
      } else {
        candidates[1] = DENS_ED;
        candidates[2] = DENS_SD;
      }
    }

    int r = 0;
    DiskDensity usedMode = DENS_UNKNOWN;

    for (int i = 0; i < 3; i++) {
      DiskDensity mode = candidates[i];
      if (mode == DENS_UNKNOWN) continue;

      bool dup = false;
      for (int j = 0; j < i; j++) {
        if (candidates[j] == mode) { dup = true; break; }
      }
      if (dup) continue;

      if (mode == DENS_DD && sec > 3) {
        primeXf551DD(devLogic);
      }

      r = readSectorFromXFMode(devLogic, sec, mode, buf);
      if (r > 0) {
        usedMode = mode;
        break;
      }

      if (!g_diskDensityKnown && mode == DENS_SD && sec > 3) {
        autoDetectDiskDensity();
      }
    }

    if (r <= 0 || usedMode == DENS_UNKNOWN) {
      sendNAK();
      resetTrackCache();
      return;
    }

    sz = r;
    g_diskDensityKnown = true;
    g_diskDensity = usedMode;
    g_diskBytesPerSector = expectedSectorSizeForMode(usedMode, sec);
    if (usedMode == DENS_DD && sz == 256) {
      g_ddForceActive = true;
      g_lastDdForceMs = millis();
    } else if (usedMode != DENS_DD) {
      g_ddForceActive = false;
    }

    reqTrackStart = trackStartForSector(sec, usedMode);
    reqTrackSpt   = (sec <= 3) ? 1 : (uint8_t)sectorsPerTrackForDensity(usedMode);
    reqTrackIdx   = sectorIndexInTrack(sec, usedMode);
    if (LOG_CACHE_DIAG) {
      logf("[CACHE-DIAG] PHYS READ dev=D%u sec=%u dens=%s size=%d start=%u idx=%u",
           (unsigned)(devLogic - 0x30),
           (unsigned)sec,
           densityName(usedMode),
           sz,
           (unsigned)reqTrackStart,
           (unsigned)reqTrackIdx);
    }
  }

  if (sec <= BOOT_CACHE_SECTORS) {
    bootCacheStore(devLogic, sec, buf, sz);
  }

  sendACK();
  sendSectorChunk(sec, buf, sz);

  bool isSequentialRead = (lastReadDev == devLogic &&
                           lastReadDensity == g_diskDensity &&
                           sec == (uint16_t)(lastReadSec + 1));

  if (isSequentialRead) {
    if (seqReadStreak < 255) seqReadStreak++;
  } else {
    seqReadStreak = 0;
  }

  uint8_t effectivePf = pfCount;
  if (effectivePf == 0 && g_diskDensityKnown) {
    if (sec <= BOOT_CACHE_SECTORS) {
      // Mantener cache de boot 1-3: mejora arranque sin tocar loaders posteriores.
      effectivePf = BOOT_CACHE_SECTORS;
    } else if (seqReadStreak >= TRACK_BURST_MIN_STREAK) {
      // V6 loader-safe: no leer por adelantado en el primer salto de un loader.
      // Solo hacemos micro-burst cuando ya hay patrón secuencial real.
      effectivePf = TRACK_BURST_SECTORS;
    } else {
      effectivePf = 0;
    }
  }

  if (effectivePf == 0) {
    resetTrackCache();
    return;
  }
  if (effectivePf > MAX_PREFETCH_SECTORS) effectivePf = MAX_PREFETCH_SECTORS;

  if (sec <= BOOT_CACHE_SECTORS) {
    preloadBootCache(devLogic, g_diskDensity, (uint16_t)sz);
    lastReadSec = sec;
    lastReadDev = devLogic;
    lastReadDensity = g_diskDensity;
    return;
  }

  // Preparar/retener caché por pista actual
  if (cacheCount == 0 ||
      cacheDev != devLogic ||
      cacheDensity != g_diskDensity ||
      cacheTrackStartSec != reqTrackStart ||
      cacheTrackSpt != reqTrackSpt) {
    if (LOG_CACHE_DIAG) {
      logf("[CACHE-DIAG] CACHE RESET->TRACK dev=D%u sec=%u newStart=%u newSpt=%u dens=%s oldStart=%u oldValid=%u/%u",
           (unsigned)(devLogic - 0x30),
           (unsigned)sec,
           (unsigned)reqTrackStart,
           (unsigned)reqTrackSpt,
           densityName(g_diskDensity),
           (unsigned)cacheTrackStartSec,
           (unsigned)cacheCount,
           (unsigned)cacheTrackSpt);
    }
    resetTrackCache();
    cacheDev = devLogic;
    cacheDensity = g_diskDensity;
    cacheTrackStartSec = reqTrackStart;
    cacheTrackSpt = reqTrackSpt;
  }

  // Guardar siempre el sector actual en su índice de pista
  if ((cacheValidMask & (1UL << reqTrackIdx)) == 0) {
    cacheCount++;
    cacheValidMask |= (1UL << reqTrackIdx);
  }
  memcpy(cacheBuf[reqTrackIdx], buf, sz);

  uint8_t loadedThisPass = 1;
  for (uint8_t i = 1; i < effectivePf; i++) {
    uint16_t nextSec = (uint16_t)(sec + i);
    if (trackStartForSector(nextSec, g_diskDensity) != reqTrackStart) break;

    uint8_t nextIdx = sectorIndexInTrack(nextSec, g_diskDensity);
    if (cacheValidMask & (1UL << nextIdx)) {
      loadedThisPass++;
      continue;
    }

    int r = readSectorFromXFMode(devLogic, nextSec, g_diskDensity, cacheBuf[nextIdx]);
    if (r != sz) break;

    cacheValidMask |= (1UL << nextIdx);
    cacheCount++;
    loadedThisPass++;
  }

  if (LOG_CACHE_DIAG) {
    bool wholeTrack = (cacheTrackSpt > 0 && cacheCount >= cacheTrackSpt);
    logf("[CACHE-DIAG] FILL dev=D%u sec=%u start=%u idx=%u loaded=%u valid=%u/%u dens=%s%s",
         (unsigned)(devLogic - 0x30),
         (unsigned)sec,
         (unsigned)cacheTrackStartSec,
         (unsigned)reqTrackIdx,
         (unsigned)loadedThisPass,
         (unsigned)cacheCount,
         (unsigned)cacheTrackSpt,
         densityName(g_diskDensity),
         (wholeTrack ? " [full-track]" : ""));
  } else if (cacheCount > 1 && LOG_PREFETCH) {
    bool wholeTrack = (cacheTrackSpt > 0 && cacheCount >= cacheTrackSpt);
    logf("[CACHE] Track cache: valid=%u/%u start=%u from=%u (%s)%s%s%s",
         cacheCount,
         cacheTrackSpt,
         cacheTrackStartSec,
         sec,
         densityName(g_diskDensity),
         (pfCount == 0 ? " [auto]" : ""),
         (seqReadStreak >= 1 ? " [seq]" : ""),
         (wholeTrack ? " [full-track]" : ""));
  }

  // v16: preload automático de pista siguiente desactivado para evitar picos dobles.
  invalidateNextTrackCache();

