Razer3001/ATARI_XF551_RP/ESP32_Slave_Bridge/ESP32_Slave_Bridge.ino
  lastReadSec = sec;
  lastReadDev = devLogic;
  lastReadDensity = g_diskDensity;
}

void handleStatusFromMaster(uint8_t devLogic, uint8_t aux1, uint8_t aux2, bool dd) {
  g_lastLogicDev = devLogic;
  // v16: limpiar caches/estado secuencial en comandos especiales para evitar contaminación D1/D2
  resetTrackCache();
  invalidateBootCache();
  seqReadStreak = 0;
  lastReadSec = 0;
  lastReadDev = 0;
  lastReadDensity = DENS_UNKNOWN;
  (void)dd;
  // Acepta cualquier dev lógico: el MASTER decide por MAC
writePending = false;
  percomWritePending = false;

  if (superdosCompatIsActive(devLogic) && statusOverrideIsActive()) {
    sendACK();
    sendSectorChunk(0, g_statusOverride, 4);
    logf("[SLAVE] STATUS lógico limpio enviado: %02X %02X %02X %02X",
         g_statusOverride[0], g_statusOverride[1], g_statusOverride[2], g_statusOverride[3]);
    return;
  }

  uint8_t frame[5] = { g_physicalDev, 0x53, aux1, aux2, 0 };
  frame[4] = sioChecksum(frame, 4);

  pulseCommandAndSendFrame(frame);

  if (!waitByte(SIO_ACK, 3000)) { sendNAK(); return; }

  uint8_t st[4];
  int len = 4;
  if (!readFromDrive(st, len, 8000)) { sendNAK(); return; }

  DiskDensity visible = hostVisibleDensity();
  if (superdosCompatIsActive(devLogic) && visible == DENS_DD) {
    st[0] &= (uint8_t)~0x80;
    st[2] = 0xFE;
    st[3] = 0x00;
    logf("[XF] STATUS normalizado a DD confirmado: %02X %02X %02X %02X",
         st[0], st[1], st[2], st[3]);
  }

  sendACK();
  sendSectorChunk(0, st, 4);
}

// FIX: formatXF simplificado - ignora eco, confía en COMPLETE
static void formatXF(uint8_t cmd, uint8_t aux1, uint8_t aux2, bool isDD) {
  g_formatInProgress = true;

  uint8_t base = cmd & 0x7F;
  uint8_t driveCmd = cmd;

  int formatReplyLen = SECTOR_128;

  // Solo el PERCOM pendiente manda realmente el tamaño de cierre.
  if (g_percomPendingValid && percomUses256(g_percomPendingBlock)) {
    formatReplyLen = SECTOR_256;
  }

  // Para 0x21 sin PERCOM pendiente, no usar isDD arrastrado.
  if (base == 0x21 && !g_percomPendingValid) {
    formatReplyLen = SECTOR_128;
  }

  if (g_is1050Like && !supports256 && g_percomPendingValid) {
    DiskDensity pendingDensity = percomUses256(g_percomPendingBlock) ? DENS_DD : ((percomSectorsPerTrack(g_percomPendingBlock) == 26) ? DENS_ED : DENS_SD);
    if (pendingDensity == DENS_ED && base == 0x21 && g_supportsFormat22) {
      driveCmd = 0x22;
      formatReplyLen = SECTOR_128;
      logf("[1050] FORMAT traducido 0x21 -> 0x22 por PERCOM/ED pendiente");
    }
  }

  if (g_is1050Like && !supports256 && base == 0x22) {
    formatReplyLen = SECTOR_128;
  }

  unsigned long timeout = (formatReplyLen >= 256) ? 360000UL : 150000UL;

  bool skewHs = (cmd == 0xA1);
  logf("[%s] FORMAT iniciando cmd=0x%02X driveCmd=0x%02X base=0x%02X skewHS=%d isDD=%d pending=%d replyLen=%d",
       driveProfileName(g_driveProfile), cmd, driveCmd, base, skewHs ? 1 : 0, isDD ? 1 : 0, g_percomPendingValid ? 1 : 0, formatReplyLen);

  drainSio(100);

  uint8_t frame[5];
  frame[0] = g_physicalDev;
  frame[1] = driveCmd;
  // XF551/1050: al invocar FORMAT conviene usar AUX1/AUX2 en cero hacia el drive real.
  (void)aux1;
  (void)aux2;
  frame[2] = 0x00;
  frame[3] = 0x00;
  frame[4] = sioChecksum(frame, 4);

  pulseCommandAndSendFrame(frame);

  if (!waitByte(SIO_ACK, 5000)) {
    logf("[XF] FORMAT: No ACK de XF551");
    g_formatInProgress = false;
    sendNAK();
    return;
  }

  logf("[XF] FORMAT: ACK recibido, esperando COMPLETE...");

  unsigned long t0 = millis();
  bool gotComplete = false;

  while (millis() - t0 < timeout) {
    yield();

    while (SerialSIO.available()) {
      uint8_t b = SerialSIO.read();

      if (b == SIO_COMPLETE) {
        gotComplete = true;
        logf("[XF] FORMAT: COMPLETE tras %lus", (millis() - t0) / 1000);
        break;
      } else if (b == SIO_ERROR || b == SIO_NAK) {
        logf("[XF] FORMAT: ERROR/NAK 0x%02X", b);
        g_formatInProgress = false;
        sendNAK();
        return;
      }
    }

    if (gotComplete) break;
    delay(10);
    yield();
  }

  if (!gotComplete) {
    logf("[XF] FORMAT: Timeout");
    g_formatInProgress = false;
    sendNAK();
    return;
  }

  delay(20);
  while (SerialSIO.available()) {
    SerialSIO.read();
  }

  uint8_t buf[MAX_SECTOR_BYTES];
  memset(buf, 0xFF, sizeof(buf));

  g_formatInProgress = false;
  resetTrackCache();
  invalidateBootCache();
  seqReadStreak = 0;
  lastReadSec = 0;
  lastReadDev = 0;
  lastReadDensity = DENS_UNKNOWN;
  resetDiskDetection();

  if (g_percomPendingValid) {
    uint16_t bps = percomBytesPerSector(g_percomPendingBlock);
    uint16_t spt = percomSectorsPerTrack(g_percomPendingBlock);
    g_diskBytesPerSector  = bps;
    g_diskSectorsPerTrack = spt;
    g_diskDensity         = (bps >= 256) ? DENS_DD : ((spt == 26) ? DENS_ED : DENS_SD);
    g_diskDensityKnown    = true;
    if (g_diskDensity == DENS_DD) {
      g_ddForceActive = true;
      g_lastDdForceMs = millis();
    } else {
      remember128Density(g_diskDensity);
      g_ddForceActive = false;
    }
    g_percomPendingNeedsReadback = true;

    logf("[XF] FORMAT OK - manteniendo PERCOM pendiente: mode=%s",
         percomModeName(g_percomPendingBlock));
    bool recentPendingSeq = hadRecentPercomPendingSequence(g_lastLogicDev);
    bool pendingIsDD = percomUses256(g_percomPendingBlock);
    if (pendingIsDD && recentPendingSeq) {
      enableSuperdosCompat(g_lastLogicDev, 12000, "READ PERCOM pendiente DD -> WRITE PERCOM -> FORMAT");
      g_lastWritePercomAfterPendingMs = 0;
      g_lastWritePercomAfterPendingDev = 0;
      g_lastReadPercomPendingMs = 0;
      g_lastReadPercomPendingDev = 0;
    } else if (pendingIsDD && (superdosCompatIsActive(g_lastLogicDev) || cmd == 0xA1)) {
      enableSuperdosCompat(g_lastLogicDev, 30000, "FORMAT DD con PERCOM pendiente");
    } else if (!pendingIsDD) {
      g_lastWritePercomAfterPendingMs = 0;
      g_lastWritePercomAfterPendingDev = 0;
      g_lastReadPercomPendingMs = 0;
      g_lastReadPercomPendingDev = 0;
    }
  } else {
    g_diskBytesPerSector  = (formatReplyLen >= 256) ? 256 : 128;
    g_diskSectorsPerTrack = (formatReplyLen >= 256) ? 18 : 18;
    g_diskDensity         = (formatReplyLen >= 256) ? DENS_DD : DENS_SD;
    g_diskDensityKnown    = true;
    if (g_diskDensity == DENS_DD) {
      g_ddForceActive = true;
      g_lastDdForceMs = millis();
    } else {
      remember128Density(g_diskDensity);
      g_ddForceActive = false;
    }
  }

  DiskDensity statusDensity = g_diskDensityKnown ? g_diskDensity : hostVisibleDensity();
  if (statusDensity == DENS_UNKNOWN) statusDensity = hostVisibleDensity();

  sendACK();
  sendSectorChunk(0, buf, formatReplyLen);
  armStatusOverrideForDensity(statusDensity, 6000, "FORMAT OK");
  logf("[XF] FORMAT completado len=%d", formatReplyLen);
}

// [F24] Eliminado helper no usado: handleFormatSD
// [F24] Eliminado helper no usado: handleFormatDD
void handleWriteFromMaster(uint8_t devLogic, uint8_t cmd, uint16_t sec, bool dd) {
  g_lastLogicDev = devLogic;
  // Acepta cualquier dev lógico: el MASTER decide por MAC
// AUTO-DETECCIÓN: Si el Master dice SD pero detectamos DD, usar DD
  if (!dd && g_ddForceActive) {
    dd = true;
    logf("[SLAVE] WRITE: Corrigiendo SD->DD (disco detectado como DD)");
  }

