Razer3001/ATARI_XF551_RP/ESP32_Slave_Bridge/ESP32_Slave_Bridge.ino
  writePending   = true;
  writePendDev   = devLogic;
  writePendCmd   = cmd;
  writePendSec   = sec;
  writePendDD    = dd;

  memset(writeBuf, 0, sizeof(writeBuf));
  writeMaxEnd     = 0;
  writeChunkCount = 0;
  writeChunkMask  = 0;

  writeExpected = (int)expectedSectorSizeForDensity(dd, sec);

  resetTrackCache();
  invalidateBootCache();
  seqReadStreak = 0;
  lastReadSec = 0;
  lastReadDev = 0;
  lastReadDensity = DENS_UNKNOWN;
}

void handleReadPercomFromMaster(uint8_t devLogic, uint8_t aux1, uint8_t aux2) {
  g_lastLogicDev = devLogic;
  // v16: limpiar caches/estado secuencial en comandos especiales para evitar contaminación D1/D2
  resetTrackCache();
  invalidateBootCache();
  seqReadStreak = 0;
  lastReadSec = 0;
  lastReadDev = 0;
  lastReadDensity = DENS_UNKNOWN;
  uint8_t buf[PERCOM_BLOCK_LEN];
  memset(buf, 0, sizeof(buf));

  if (g_percomPendingValid) {
    memcpy(buf, g_percomPendingBlock, PERCOM_BLOCK_LEN);

    uint16_t bps = percomBytesPerSector(buf);
    uint16_t spt = percomSectorsPerTrack(buf);
    uint8_t sides = percomSides(buf);

    g_diskBytesPerSector  = bps;
    g_diskSectorsPerTrack = spt;
    g_diskDensity         = (bps >= 256) ? DENS_DD : ((spt == 26) ? DENS_ED : DENS_SD);
    g_diskDensityKnown    = true;
    if (g_diskDensity == DENS_DD) {
      g_ddForceActive = true;
      g_lastDdForceMs = millis();
    } else {
      remember128Density(g_diskDensity);
      g_ddForceActive = false;
    }

    logf("[SLAVE] READ PERCOM -> devolviendo PENDIENTE: mode=%s bps=%u spt=%u sides=%u",
         percomModeName(buf), (unsigned)bps, (unsigned)spt, (unsigned)sides);
    if (percomUses256(buf)) {
      g_lastReadPercomPendingMs = millis();
      g_lastReadPercomPendingDev = devLogic;
    } else {
      g_lastReadPercomPendingMs = 0;
      g_lastReadPercomPendingDev = 0;
    }

    sendACK();
    sendSectorChunk(PERCOM_SEC_MAGIC, buf, PERCOM_BLOCK_LEN);

    if (g_percomPendingNeedsReadback) {
      g_percomPendingNeedsReadback = false;
      g_percomPendingValid = false;
    }
    return;
  }

  if (!readPercomFromXF(devLogic, aux1, aux2, buf)) { sendNAK(); return; }

  uint16_t bps = percomBytesPerSector(buf);
  uint16_t spt = percomSectorsPerTrack(buf);
  uint8_t sides = percomSides(buf);

  g_diskBytesPerSector  = bps;
  g_diskSectorsPerTrack = spt;
  g_diskDensity         = (bps >= 256) ? DENS_DD : ((spt == 26) ? DENS_ED : DENS_SD);
  g_diskDensityKnown    = true;
  if (g_diskDensity == DENS_DD) {
    g_ddForceActive = true;
    g_lastDdForceMs = millis();
  } else {
    remember128Density(g_diskDensity);
    g_ddForceActive = false;
  }

  logf("[SLAVE] READ PERCOM → XF551 real: mode=%s bps=%u spt=%u sides=%u",
       percomModeName(buf), (unsigned)bps, (unsigned)spt, (unsigned)sides);

  sendACK();
  sendSectorChunk(PERCOM_SEC_MAGIC, buf, PERCOM_BLOCK_LEN);
}

void handleWritePercomFromMaster(uint8_t devLogic, uint8_t aux1, uint8_t aux2) {
  g_lastLogicDev = devLogic;
  // v16: limpiar caches/estado secuencial en comandos especiales para evitar contaminación D1/D2
  resetTrackCache();
  invalidateBootCache();
  seqReadStreak = 0;
  lastReadSec = 0;
  lastReadDev = 0;
  lastReadDensity = DENS_UNKNOWN;
  // Acepta cualquier dev lógico: el MASTER decide por MAC
  percomWritePending = true;
  percomWriteDev     = devLogic;
  percomLen          = 0;

  g_percomAux1 = aux1;
  g_percomAux2 = aux2;

  memset(percomWriteBuf, 0, sizeof(percomWriteBuf));
  resetTrackCache();
  invalidateBootCache();
  seqReadStreak = 0;
  lastReadSec = 0;
  lastReadDev = 0;
  lastReadDensity = DENS_UNKNOWN;

  logf("[SLAVE] WRITE PERCOM pendiente para D%u", (unsigned)(devLogic - 0x30));
}

static inline uint32_t fullMask32(uint8_t count) {
  if (count == 0) return 0;
  if (count >= 32) return 0xFFFFFFFFUL;
  return (1UL << count) - 1UL;
}

void handleSectorChunkFromMaster(const uint8_t* in, int len) {
  if (len < 6) return;

  uint8_t devLogic = in[1];
  g_lastLogicDev = devLogic;
  uint16_t sec     = (uint16_t)in[2] | ((uint16_t)in[3] << 8);
  uint8_t idx      = in[4];
  uint8_t count    = in[5];
  const uint8_t* payload = &in[6];
  int dlen = len - 6;
  // Acepta cualquier dev lógico: el MASTER decide por MAC
// WRITE SECTOR
  if (writePending && devLogic == writePendDev && sec == writePendSec) {
    if (dlen <= 0 || count == 0) {
      sendNAK();
      writePending = false;
      return;
    }

    if (writeChunkCount == 0) {
      writeChunkCount = count;
      writeChunkMask  = 0;
      writeMaxEnd     = 0;
    } else if (count != writeChunkCount) {
      sendNAK();
      writePending = false;
      return;
    }

    if (idx >= count) {
      sendNAK();
      writePending = false;
      return;
    }

    int expectedChunks = (writeExpected + CHUNK_PAYLOAD - 1) / CHUNK_PAYLOAD;
    if (count != expectedChunks) {
      logf("[SLAVE] ❌ WRITE chunkCount inválido: count=%u esperado=%d", count, expectedChunks);
      sendNAK();
      writePending = false;
      return;
    }

    int off = (int)idx * (int)CHUNK_PAYLOAD;
    if (off < 0 || off >= MAX_SECTOR_BYTES) {
      sendNAK();
      writePending = false;
      return;
    }

    int room = MAX_SECTOR_BYTES - off;
    if (dlen > room) dlen = room;
    if (dlen <= 0) {
      sendNAK();
      writePending = false;
      return;
    }

    memcpy(writeBuf + off, payload, dlen);
    int endPos = off + dlen;
    if (endPos > writeMaxEnd) writeMaxEnd = endPos;

    if (idx < 32) writeChunkMask |= (1UL << idx);

    uint32_t need = fullMask32(writeChunkCount);
    if (need != 0 && ((writeChunkMask & need) == need)) {
      if (writeMaxEnd < writeExpected) {
        logf("[SLAVE] ❌ WRITE incompleto: maxEnd=%d esperado=%d", writeMaxEnd, writeExpected);
        sendNAK();
      } else {
        bool ok = writeSectorToXF(writePendDev, writePendCmd, writePendSec, writePendDD, writeBuf, writeExpected);
        if (ok) sendACK(); else sendNAK();
      }

      writePending = false;
    }
    return;
  }

  // WRITE PERCOM
  if (percomWritePending && devLogic == percomWriteDev && sec == PERCOM_SEC_MAGIC) {
    if (dlen <= 0 || count == 0) {
      sendNAK();
      percomWritePending = false;
      return;
    }

    if (idx >= count) {
      sendNAK();
      percomWritePending = false;
      return;
    }

    int expectedChunks = (PERCOM_BLOCK_LEN + CHUNK_PAYLOAD - 1) / CHUNK_PAYLOAD;
    if (count != expectedChunks) {
      sendNAK();
      percomWritePending = false;
      return;
    }

    int off = (int)idx * (int)CHUNK_PAYLOAD;
    if (off < 0 || off >= PERCOM_BLOCK_LEN) {
      sendNAK();
      percomWritePending = false;
      return;
    }

    int room = PERCOM_BLOCK_LEN - off;
    if (dlen > room) dlen = room;
    if (dlen <= 0) {
      sendNAK();
      percomWritePending = false;
      return;
    }

    memcpy(percomWriteBuf + off, payload, dlen);
    int endPos = off + dlen;
    if (endPos > percomLen) percomLen = endPos;

    bool last = (idx + 1 >= count);
    if (!last) return;

    uint8_t percomApplied[PERCOM_BLOCK_LEN];
    memset(percomApplied, 0, sizeof(percomApplied));
    memcpy(percomApplied, percomWriteBuf, min(percomLen, PERCOM_BLOCK_LEN));

    // DOS 2.5/1050: sanear ANTES de escribirlo a la unidad física.
    sanitizePercomForDos25(percomApplied);

    uint8_t currentPercom[PERCOM_BLOCK_LEN];
    bool haveCurrentPercom = readPercomFromXF(percomWriteDev, g_percomAux1, g_percomAux2, currentPercom);

