Razer3001/ATARI_XF551_RP/ESP32_Slave_Bridge/ESP32_Slave_Bridge.ino
    uint16_t reqBps   = percomBytesPerSector(percomApplied);
    uint16_t reqSpt   = percomSectorsPerTrack(percomApplied);
    uint8_t  reqSides = percomSides(percomApplied);

    bool sameCanonicalSD =
      haveCurrentPercom &&
      (reqBps == 128) && (reqSpt == 18) && (reqSides == 1) &&
      (percomBytesPerSector(currentPercom) == 128) &&
      (percomSectorsPerTrack(currentPercom) == 18) &&
      (percomSides(currentPercom) == 1);

    bool sameAsPending = g_percomPendingValid &&
                         memcmp(g_percomPendingBlock, percomApplied, PERCOM_BLOCK_LEN) == 0;
    bool sameAsCurrent = haveCurrentPercom &&
                         memcmp(currentPercom, percomApplied, PERCOM_BLOCK_LEN) == 0;

    bool ok = true;
    if (sameAsPending || sameAsCurrent || sameCanonicalSD) {
      logf("[SLAVE] WRITE PERCOM redundante: aceptado lógico, sin reescribir hardware (pending=%u current=%u canonSD=%u)",
           sameAsPending ? 1 : 0, sameAsCurrent ? 1 : 0, sameCanonicalSD ? 1 : 0);
    } else {
      ok = writePercomToXF(percomWriteDev, 0x00, 0x00,
                           percomApplied, PERCOM_BLOCK_LEN);
    }

    if (!ok) {
      percomWritePending = false;
      sendNAK();
      return;
    }

    memset(g_percomPendingBlock, 0, sizeof(g_percomPendingBlock));
    memcpy(g_percomPendingBlock, percomApplied, PERCOM_BLOCK_LEN);
    g_percomPendingValid = true;
    g_percomPendingCmd = 0x4F;
    g_lastPercomWriteMs = millis();
    g_percomPendingNeedsReadback = !(sameAsPending || sameAsCurrent || sameCanonicalSD);

    uint16_t bps = percomBytesPerSector(g_percomPendingBlock);
    uint16_t spt = percomSectorsPerTrack(g_percomPendingBlock);
    uint8_t sides = percomSides(g_percomPendingBlock);

    logf("[SLAVE] WRITE PERCOM aplicado: mode=%s bps=%u spt=%u sides=%u",
         percomModeName(g_percomPendingBlock),
         (unsigned)bps, (unsigned)spt, (unsigned)sides);

    g_diskBytesPerSector  = bps;
    g_diskSectorsPerTrack = spt;
    g_diskDensity         = (bps >= 256) ? DENS_DD : ((spt == 26) ? DENS_ED : DENS_SD);
    g_diskDensityKnown    = true;
    if (g_diskDensity != DENS_DD) remember128Density(g_diskDensity);
    g_ddForceActive = false;
    clearStatusOverride();

    if (percomUses256(g_percomPendingBlock) &&
        g_lastReadPercomPendingDev == percomWriteDev &&
        (millis() - g_lastReadPercomPendingMs) <= 5000UL) {
      g_lastWritePercomAfterPendingMs = millis();
      g_lastWritePercomAfterPendingDev = percomWriteDev;
      logf("[COMPAT] Secuencia PERCOM pendiente DD detectada dev=0x%02X (ventana 15000ms)", percomWriteDev);
    } else if (!percomUses256(g_percomPendingBlock)) {
      g_lastWritePercomAfterPendingMs = 0;
      g_lastWritePercomAfterPendingDev = 0;
    }

    percomWritePending = false;

    sendACK();
    sendSectorChunk(PERCOM_SEC_MAGIC, g_percomPendingBlock, PERCOM_BLOCK_LEN);
    return;
  }
}

// ===== CFG UPDATE handler =====
void handleCfgUpdate(const uint8_t* in, int len) {
  if (len < 11) return;
  uint8_t target = in[1];
  if (target != 0x00 && target != g_physicalDev) return;

  uint32_t newSio = getLE32(&in[2]);
  uint32_t newNet = getLE32(&in[6]);
  uint8_t  vflg   = in[10];

  if (newSio < 9600) newSio = 9600;
  if (newSio > 115200) newSio = 115200;
  if (newNet > 20000) newNet = 20000;

  bool changed = (newSio != g_lastCfgSio) || (newNet != g_lastCfgNet) || (vflg != g_lastCfgVflg);

  if (changed) {
    g_netDelayUs = newNet;
    applyVerifyFlags(vflg);

    // Aplica baud solo cuando esté idle y solo si realmente cambia.
    if (newSio != g_xfSioBaud && newSio != g_pendingXfSioBaud) {
      g_pendingXfSioBaud = newSio;
    }

    g_lastCfgSio = newSio;
    g_lastCfgNet = newNet;
    g_lastCfgVflg = vflg;
  }

  // ACK siempre, aunque sea duplicado, para que el MASTER no reintente.
  uint8_t ack[12];
  ack[0] = TYPE_CFG_ACK;
  ack[1] = g_physicalDev;
  ack[2] = 1;
  ack[3] = g_verifyFlags;
  putLE32(&ack[4], g_pendingXfSioBaud ? g_pendingXfSioBaud : g_xfSioBaud);
  putLE32(&ack[8], g_netDelayUs);
  send_now_to(replyMac(), ack, sizeof(ack));

  if (changed) {
    logf("[CFG] UPDATE vflg=0x%02X netDelayUs=%lu xfSio(pend)=%lu",
         (unsigned)g_verifyFlags,
         (unsigned long)g_netDelayUs,
         (unsigned long)(g_pendingXfSioBaud ? g_pendingXfSioBaud : g_xfSioBaud));
  }
}

static void processIncomingPacket(const uint8_t* src, const uint8_t* in, int len) {
  markActivity();
  if (len <= 0 || !in) return;
  g_lastNetActivityMs = millis();

  if (src && !isBroadcastMac(src)) {
    memcpy(g_lastMaster, src, 6);
    g_haveMasterMac = true;
    ensurePeer(g_lastMaster);
  }

  uint8_t type = in[0];

  if (type == TYPE_CFG_UPDATE) {
    handleCfgUpdate(in, len);
    return;
  }

  if (type == TYPE_SUPERDOS_HINT && len >= 3) {
    // v15: ignorar hint en SLAVE para S/E estilo v6
    return;
  }

  if (type == TYPE_SECTOR_CHUNK && len >= 6) {
    handleSectorChunkFromMaster(in, len);
    return;
  }

  if (type == TYPE_CMD_FRAME && len >= 6) {
    uint8_t cmd  = in[1];
    uint8_t dev  = in[2];
    uint8_t aux1 = in[3];
    uint8_t aux2 = in[4];
    bool    dd   = supports256 && (in[5] != 0);
    uint8_t pf   = (len >= 7) ? in[6] : 1;

    if (dev < DEV_MIN || dev > DEV_MAX) { sendNAK(); return; }
    g_lastLogicDev = dev;

    uint8_t base = cmd & 0x7F;
    uint16_t sec = (uint16_t)aux1 | ((uint16_t)aux2 << 8);

    if (base == 0x21 || base == 0x22) {
      g_currentDD = dd;
      logf("[SLAVE] FORMAT cmd=0x%02X dd=%d", cmd, dd);
    } else if (base == 0x52 || base == 0x50 || base == 0x57) {
      g_currentDD = dd;
    }

    if (base == 0x52) { handleReadFromMaster(dev, sec, dd, pf); return; }
    if (base == 0x53) { handleStatusFromMaster(dev, aux1, aux2, dd); return; }
    if (base == 0x21 || base == 0x22) { formatXF(cmd, aux1, aux2, dd); return; }
    if (base == 0x50 || base == 0x57) { handleWriteFromMaster(dev, cmd, sec, dd); return; }
    if (base == 0x4E) { handleReadPercomFromMaster(dev, aux1, aux2); return; }
    if (base == 0x4F) { handleWritePercomFromMaster(dev, aux1, aux2); return; }

    sendNAK();
  }
}

