Razer3001/ATARI_XF551_RP/ESP32_Slave_Bridge/ESP32_Slave_Bridge.ino
// ================== CALLBACK ESP-NOW ==================
#if ESP_IDF_VERSION_MAJOR >= 5
void onDataRecv(const esp_now_recv_info_t *info, const uint8_t* in, int len) {
  const uint8_t *src = info ? info->src_addr : nullptr;
  (void)enqueueRxPacket(src, in, len);
}

void onDataSent(const wifi_tx_info_t *info, esp_now_send_status_t s) {
  (void)info;
  (void)s;
}
#else
void onDataRecv(const uint8_t* src, const uint8_t* in, int len) {
  (void)enqueueRxPacket(src, in, len);
}

void onDataSent(const uint8_t* mac, esp_now_send_status_t s) {
  (void)mac;
  (void)s;
}
#endif

// ✅ Comando para mostrar estadísticas
void printStats() {
  logf("\n=== ESTADÍSTICAS XF551 SLAVE ===");
  logf("Total READs:      %lu", (unsigned long)g_totalReads);
  logf("Total WRITEs:     %lu", (unsigned long)g_totalWrites);
  logf("Checksum FAILs:   %lu", (unsigned long)g_checksumFailures);
  logf("Verify FAILs:     %lu", (unsigned long)g_verifyFailures);
  logf("RX queue drops:    %lu", (unsigned long)g_rxDrops);
  logf("XF551 SIO baud:   %lu", (unsigned long)g_xfSioBaud);
  logf("Net delay (us):   %lu", (unsigned long)g_netDelayUs);
  logf("Verify flags:     0x%02X", (unsigned)g_verifyFlags);
  logf("================================\n");
}



// ===== Auto-detect unidad física XF551 (D1..D4) =====
// Nota: el ESP32 usa g_physicalDev para hablar con la XF551, pero responde al MASTER usando
// el dev lógico (g_lastLogicDev) que venga en los frames del MASTER.
uint8_t detectPhysicalDev() {
  // Intenta STATUS (0x53) en D1..D4 y elige el primero que responda.
  uint8_t st[4];

  for (uint8_t dev = DEV_MIN; dev <= DEV_MAX; dev++) {
    uint8_t frame[5];
    frame[0] = dev;
    frame[1] = 0x53; // STATUS
    frame[2] = 0x00;
    frame[3] = 0x00;
    frame[4] = sioChecksum(frame, 4);

    drainSio(DRAIN_MS);
    pulseCommandAndSendFrame(frame);

    // esperar ACK (0x41)
    if (!waitByte(SIO_ACK, 300)) continue;

    int len = 4;
    if (!readFromDrive(st, len, 800)) continue;

    return dev;
  }

  return DEV_MIN; // fallback
}

// ======== SETUP / LOOP ========
void setup() {
  Serial.begin(SERIAL_DEBUG_BAUD);
  applyDriveProfile(g_driveProfile);
  Serial.printf("\n[SLAVE D%u] Atari WiFi Drive Bridge v2.2 - XF551/1050 Profiles\n",
                (unsigned)(g_lastLogicDev - 0x30));
  Serial.printf("[SLAVE] Perfil por defecto: %s | 256B=%s | PERCOM=%s\n",
                driveProfileName(g_driveProfile),
                supports256 ? "SI" : "NO",
                g_supportsPercomRW ? "SI" : "NO");
  Serial.print(F("[BUILD] SLAVE="));
  Serial.println(SLAVE_BUILD);

  g_xfSioBaud = 19200;
  SerialSIO.begin((uint32_t)g_xfSioBaud, SERIAL_8N1, SIO_RX, SIO_TX);

  // Detectar automáticamente la unidad física (jumpers XF551)
  g_physicalDev = detectPhysicalDev();
  g_lastLogicDev = g_physicalDev;
  Serial.printf("[SLAVE] Unidad física detectada: 0x%02X (D%d)\n", g_physicalDev, (int)(g_physicalDev - 0x30));


  applyVerifyFlags(g_verifyFlags);

  pinMode(SIO_COMMAND, OUTPUT);
  digitalWrite(SIO_COMMAND, HIGH);

  logDriveProfileSummary("boot");

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);

  esp_wifi_set_promiscuous(true);
  esp_wifi_set_channel(ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);
  esp_wifi_set_promiscuous(false);

  if (esp_now_init() != ESP_OK) {
    Serial.println("[ERR] esp_now_init falló");
    ESP.restart();
  }

  esp_now_register_recv_cb(onDataRecv);
  esp_now_register_send_cb(onDataSent);

  ensurePeer(BCAST_MAC);

  sendHello();
  g_lastHelloMs = millis();
  g_lastNetActivityMs = millis();

  resetTrackCache();
  invalidateBootCache();
  seqReadStreak = 0;
  lastReadSec = 0;
  lastReadDev = 0;
  lastReadDensity = DENS_UNKNOWN;
  writePending = false;
  percomWritePending = false;

  markActivity();
  logf("[SLAVE] ✅ Listo. Esperando comandos... (Serial: X=diag, S=stats, 1=XF551, 2=1050, 3=1050DD, P=perfil)");
}

void loop() {
  static unsigned long lastHello = 0;
  static unsigned long lastStats = 0;

  // aplicar baud pendiente cuando esté idle (no interrumpir transacción)
  if (g_pendingXfSioBaud != 0 && !g_formatInProgress) {
    if (isIdleFor(2500) && !writePending && !percomWritePending) {
      applyXfSioBaudNow(g_pendingXfSioBaud);
      logf("[CFG] ✅ XF551 SIO baud=%lu", (unsigned long)g_xfSioBaud);
      g_pendingXfSioBaud = 0;
    }
  }

  // HELLO periódico si está idle (y no hay FORMAT en progreso)
  if (millis() - lastHello > 10000) {
    if (isIdleFor(1200)) {
      sendHello();
    }
    lastHello = millis();
  }

  // Estadísticas cada 60s
  if (millis() - lastStats > 60000) {
    //printStats();
    lastStats = millis();
  }

  if (g_percomPendingValid && !g_percomPendingNeedsReadback) {
    if (millis() - g_lastPercomWriteMs > 8000) {
      g_percomPendingValid = false;
    }
  }

  // Procesar paquetes recibidos fuera del callback Wi-Fi
  for (int i = 0; i < 4; i++) {
    PendingEspNowPacket pkt;
    if (!dequeueRxPacket(pkt)) break;
    if (!pkt.valid) continue;
    processIncomingPacket(pkt.hasSrc ? pkt.src : nullptr, pkt.data, pkt.len);
  }

  while (Serial.available()) {
    int c = Serial.read();
    if (c == 'X' || c == 'x') {
      runXf551DensityDiagnostics(g_lastLogicDev);
    } else if (c == 'S' || c == 's') {
      printStats();
    } else if (c == 'P' || c == 'p') {
      logDriveProfileSummary("serial");
    } else if (c == '1') {
      applyDriveProfile(PROFILE_XF551);
      resetDiskDetection();
      logDriveProfileSummary("serial set");
    } else if (c == '2') {
      applyDriveProfile(PROFILE_1050_STOCK);
      resetDiskDetection();
      logDriveProfileSummary("serial set");
    } else if (c == '3') {
      applyDriveProfile(PROFILE_1050_DD_MOD);
      resetDiskDetection();
      logDriveProfileSummary("serial set");
    }
  }

  delay(1);
}
